
_detalhes_global = {
	["boss_icon_cache"] = {
	},
	["encounter_spell_pool"] = {
		{
			2820, -- [1]
			"瘤根", -- [2]
		}, -- [1]
		[424495] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422137] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422839] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[32409] = {
			2820, -- [1]
			"[*] 暗言術：死", -- [2]
		},
		[424497] = {
			2786, -- [1]
			"熾炎藤蔓", -- [2]
		},
		[422776] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[414425] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[424498] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422522] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[428770] = {
			2824, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[419144] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422523] = {
			2677, -- [1]
			"燃燒巨像", -- [2]
		},
		[414427] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[417806] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422524] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[428963] = {
			2677, -- [1]
			"燃燒巨像", -- [2]
		},
		[417807] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[428964] = {
			2677, -- [1]
			"燃燒巨像", -- [2]
		},
		[420422] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[410223] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[414367] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[422464] = {
			2820, -- [1]
			"污染的鞭笞者 <瘤根>", -- [2]
		},
		[421636] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[410225] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[430052] = {
			2677, -- [1]
			"哀嚎的靈魂", -- [2]
		},
		[422466] = {
			2820, -- [1]
			"污染的鞭笞者 <瘤根>", -- [2]
		},
		[114942] = {
			2709, -- [1]
			"療癒之潮圖騰 <蒜頭叔>", -- [2]
		},
		[421064] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[420236] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422277] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[421831] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422023] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[421960] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[421515] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[421898] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[422026] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[423110] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[424577] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422091] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[426108] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[417630] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[424579] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[425345] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[424581] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[416996] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[421969] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[421013] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[420950] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[420313] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421971] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[417445] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421398] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[420251] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[424140] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[430324] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[418531] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[418978] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421656] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[422039] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[418533] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[421532] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[422935] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421343] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[414777] = {
			2709, -- [1]
			"極熾之矛", -- [2]
		},
		[417455] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421090] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[196809] = {
			2820, -- [1]
			"神聖影像 <野比伸助>", -- [2]
		},
		[423705] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[427339] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[424662] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[196810] = {
			2820, -- [1]
			"神聖影像 <野比伸助>", -- [2]
		},
		[423260] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[421603] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[425492] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[421986] = {
			2820, -- [1]
			"污染的鞭笞者 <瘤根>", -- [2]
		},
		[421923] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[424665] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422243] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[424347] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[89753] = {
			2677, -- [1]
			"惡魔守衛 <斯巴達無畏>", -- [2]
		},
		[422053] = {
			2820, -- [1]
			"污染的鞭笞者 <瘤根>", -- [2]
		},
		[422691] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[423265] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[196813] = {
			2820, -- [1]
			"神聖影像 <野比伸助>", -- [2]
		},
		[423266] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[423904] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[419123] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[414342] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[419506] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422503] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[424352] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[419061] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[423715] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[422823] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[421421] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[422172] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[424578] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[423717] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[420237] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[414888] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[417789] = {
			2677, -- [1]
			"[*] 燃焰", -- [2]
		},
		[196816] = {
			2820, -- [1]
			"神聖影像 <野比伸助>", -- [2]
		},
		[428962] = {
			2677, -- [1]
			"燃燒巨像", -- [2]
		},
		[419217] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422836] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422517] = {
			2677, -- [1]
			"燃燒巨像", -- [2]
		},
		[417446] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[425530] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[423656] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[423720] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[426150] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[427928] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[420240] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[425002] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[422000] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[421450] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[31707] = {
			2709, -- [1]
			"水元素", -- [2]
		},
		[30213] = {
			2677, -- [1]
			"惡魔守衛 <斯巴達無畏>", -- [2]
		},
		[428886] = {
			2786, -- [1]
			"[*] 火焰光束", -- [2]
		},
		[428695] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[429280] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[424233] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[422961] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[425957] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[422115] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[421939] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[423649] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[425481] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[417431] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[429162] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[425574] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[422578] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[429782] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[412761] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[425575] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[404908] = {
			2677, -- [1]
			"惡魔守衛 <斯巴達無畏>", -- [2]
		},
		[424499] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[421942] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[90361] = {
			2786, -- [1]
			"色色發抖", -- [2]
		},
		[420540] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[429672] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[430051] = {
			2677, -- [1]
			"哀嚎的靈魂", -- [2]
		},
		[430677] = {
			2824, -- [1]
			"斯莫德隆", -- [2]
		},
		[424366] = {
			2820, -- [1]
			"瘤根", -- [2]
		},
		[417003] = {
			2709, -- [1]
			"『殘暴者』伊吉拉", -- [2]
		},
		[423264] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[422518] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[422837] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
		[425451] = {
			2786, -- [1]
			"丁卓爾‧睿迅", -- [2]
		},
		[421693] = {
			2677, -- [1]
			"菲拉卡", -- [2]
		},
	},
	["immersion_pets_on_solo_play"] = false,
	["npcid_ignored"] = {
	},
	["dungeon_data"] = {
	},
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
	},
	["exp90temp"] = {
		["delete_damage_TCOB"] = true,
	},
	["always_use_profile"] = false,
	["deathlog_healingdone_min_arena"] = 400,
	["spell_school_cache"] = {
		["群體糾纏"] = 4,
		["灼燒焦土"] = 4,
		["燒灼傷口"] = 1,
		["殞落之星"] = 72,
		["滅絕培育"] = 36,
		["迴旋火颶"] = 36,
		["焚世烈焰"] = 4,
		["熾炎成長"] = 4,
		["灼熱火花"] = 36,
		["菲拉雷斯的印記"] = 36,
		["旋刃"] = 36,
		["暗影脊刺"] = 1,
		["極熾高熱"] = 4,
		["灼燒之羽"] = 4,
		["災罰烙印"] = 4,
		["綻放"] = 8,
		["懼火彈幕"] = 36,
		["岩漿噴泉"] = 4,
		["收割折磨"] = 36,
		["火颶"] = 36,
		["浸染之刃"] = 36,
		["近戰"] = 1,
		["燃燒鱗片"] = 36,
		["夢境撕裂"] = 4,
		["化身"] = 1,
		["烈焰波"] = 4,
		["脈動核心"] = 36,
		["灼熱之怒"] = 4,
		["壓制餘燼"] = 4,
		["燒灼爆炸"] = 4,
		["焦黑餘燼"] = 36,
		["火焰光束"] = 4,
		["滯留燃燒"] = 4,
		["控制火勢"] = 36,
		["燃焰"] = 36,
		["灼熱尖叫"] = 36,
		["暗言術：死"] = 32,
		["破滅"] = 36,
		["滅世咆哮"] = 36,
		["熾炎蘑菇"] = 4,
		["熔火護手"] = 36,
		["穿刺折磨"] = 36,
		["過熱"] = 4,
		["著火"] = 36,
		["熾炎種子"] = 36,
		["燃焰萌芽"] = 4,
		["強效火颶"] = 36,
		["燃焰瘟疫"] = 36,
		["焰種"] = 4,
		["Corpo-a-Corpo"] = 1,
		["繁星碎片"] = 72,
		["日炎"] = 4,
		["獄火噬敵"] = 36,
		["分刺木炭"] = 36,
		["暗焰之球"] = 36,
		["腐化"] = 36,
		["拔根痛苦"] = 36,
		["燃燒守護"] = 36,
		["菲拉雷斯之焰"] = 36,
		["兇狠揮擊"] = 1,
		["獵殺者"] = 1,
		["生命烈焰"] = 4,
		["極熾之矛"] = 36,
		["灼燒餘焰"] = 4,
		["火雨"] = 4,
		["羽毛炸彈"] = 4,
		["超級新星"] = 4,
		["永恆火颶"] = 36,
		["菲拉雷斯之噬"] = 36,
	},
	["spell_category_latest_sent"] = 0,
	["damage_scroll_auto_open"] = true,
	["show_warning_id1_amount"] = 0,
	["latest_shield_spellid_cache_access"] = 1707049193,
	["current_exp_raid_encounters"] = {
		[2820] = true,
		[2709] = true,
		[2824] = true,
		[2677] = true,
		[2786] = true,
	},
	["keystone_frame"] = {
		["scale"] = 1,
		["position"] = {
		},
	},
	["show_aug_predicted_spell_damage"] = false,
	["trinket_data"] = {
		[214342] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "下降氣流",
		},
		[214350] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "夢魘精華",
		},
		[214169] = {
			["lastCombatId"] = 10,
			["maxTime"] = 114.8510000705719,
			["averageTime"] = 69,
			["activations"] = 12,
			["totalCooldownTime"] = 837.6919996738434,
			["lastPlayerName"] = "你這樣太快了",
			["minTime"] = 40.20599985122681,
			["lastActivation"] = 1707053291.622,
			["spellName"] = "殘暴重擊",
		},
		[382426] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "惡意風暴箭",
		},
		[417534] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "時間小偷之策",
		},
		[429221] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "巨神海蛇的智慧",
		},
		[214052] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "魔化隕石",
		},
		[425127] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "夢境搶救",
		},
		[215407] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "黑暗衝擊",
		},
		[397376] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "燃燒餘燼",
		},
		[421994] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "激昇怒氣",
		},
		[407961] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "熔岩浪潮",
		},
		[270827] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "織網者的靈魂寶石",
		},
		[421996] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "熊之報復",
		},
		[426674] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "spell not found",
		},
		[426564] = {
			["lastCombatId"] = 12,
			["maxTime"] = 126.0429999828339,
			["averageTime"] = 53,
			["activations"] = 26,
			["totalCooldownTime"] = 1390.109999895096,
			["lastPlayerName"] = "逆特",
			["minTime"] = 40.02099990844727,
			["lastActivation"] = 1707054388.911,
			["spellName"] = "殲滅烈焰",
		},
		[426431] = {
			["lastCombatId"] = 12,
			["maxTime"] = 174.4570000171661,
			["averageTime"] = 69,
			["activations"] = 17,
			["totalCooldownTime"] = 1181.257999897003,
			["lastPlayerName"] = "蒜頭叔",
			["minTime"] = 40.19200015068054,
			["lastActivation"] = 1707054388.071,
			["spellName"] = "火焰之民",
		},
		[427037] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "熔岩箭",
		},
		[426486] = {
			["lastCombatId"] = 12,
			["maxTime"] = 174.4579999446869,
			["averageTime"] = 75,
			["activations"] = 15,
			["totalCooldownTime"] = 1130.437999486923,
			["lastPlayerName"] = "蒜頭叔",
			["minTime"] = 41.74799990653992,
			["lastActivation"] = 1707054390.075,
			["spellName"] = "火焰之民",
		},
		[401428] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "飢餓暗焰",
		},
		[384290] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "史莫夫的伏擊",
		},
		[417458] = {
			["lastCombatId"] = 12,
			["maxTime"] = 95.62999987602234,
			["averageTime"] = 56,
			["activations"] = 19,
			["totalCooldownTime"] = 1080.232999801636,
			["lastPlayerName"] = "福僧",
			["minTime"] = 44.1399998664856,
			["lastActivation"] = 1707054386.78,
			["spellName"] = "加速沙漏",
		},
		[426676] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "艾爾玟的摯友",
		},
		[426553] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "殲滅烈焰",
		},
		[424965] = {
			["lastCombatId"] = 10,
			["maxTime"] = 114.7960000038147,
			["averageTime"] = 77,
			["activations"] = 10,
			["totalCooldownTime"] = 770.0120003223419,
			["lastPlayerName"] = "迪克杭特",
			["minTime"] = 40.72000002861023,
			["lastActivation"] = 1707053341.301,
			["spellName"] = "荊棘之靈",
		},
		[384325] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "巴夫的伏擊",
		},
		[426677] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "spell not found",
		},
		[425181] = {
			["lastCombatId"] = 10,
			["maxTime"] = 115.2309999465942,
			["averageTime"] = 78,
			["activations"] = 10,
			["totalCooldownTime"] = 782.7679998874664,
			["lastPlayerName"] = "迪克杭特",
			["minTime"] = 46.21600008010864,
			["lastActivation"] = 1707053338.319,
			["spellName"] = "荊棘爆發",
		},
		[394453] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "幼龍守衛者的燃焰",
		},
		[422441] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "受折磨的古樹之根",
		},
		[401324] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "回響閃焰",
		},
		[389839] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "火焰射擊",
		},
		[426647] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "皮波的摯友",
		},
		[429246] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "洪荒起源",
		},
		[429262] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "元水增幅",
		},
		[381760] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "突變觸手猛擊",
		},
		[426648] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "鶴之吟唱法杖",
		},
		[385903] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "水晶病疾",
		},
		[418527] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "破碎明日之鏡",
		},
		[215270] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "易碎迴音",
		},
		[92174] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "蟹化適應",
		},
		[388739] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "純粹腐朽",
		},
		[388755] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "狩魂箭",
		},
		[213786] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "夢魘隕星",
		},
		[417452] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "加速沙漏",
		},
		[425154] = {
			["lastCombatId"] = 12,
			["maxTime"] = 96.09699988365173,
			["averageTime"] = 51,
			["activations"] = 28,
			["totalCooldownTime"] = 1444.753000020981,
			["lastPlayerName"] = "熊熊戰著打",
			["minTime"] = 40.14999985694885,
			["lastActivation"] = 1707054394.748,
			["spellName"] = "兇惡烙印",
		},
		[424324] = {
			["lastCombatId"] = 12,
			["maxTime"] = 104.441999912262,
			["averageTime"] = 64,
			["activations"] = 5,
			["totalCooldownTime"] = 321.9779999256134,
			["lastPlayerName"] = "蒜頭叔",
			["minTime"] = 43.18599987030029,
			["lastActivation"] = 1707054391.234,
			["spellName"] = "飢饞暗焰",
		},
		[423611] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "靈魂點燃",
		},
		[271671] = {
			["lastCombatId"] = 12,
			["maxTime"] = 80.07399988174438,
			["averageTime"] = 70,
			["activations"] = 4,
			["totalCooldownTime"] = 280.1719999313355,
			["lastPlayerName"] = "Solu",
			["minTime"] = 55.88800001144409,
			["lastActivation"] = 1707054419.631,
			["spellName"] = "刺耳和弦",
		},
		[426672] = {
			["lastCombatId"] = 0,
			["maxTime"] = 0,
			["averageTime"] = 0,
			["activations"] = 0,
			["totalCooldownTime"] = 0,
			["lastPlayerName"] = "",
			["minTime"] = 9999999,
			["lastActivation"] = 0,
			["spellName"] = "厄托斯的摯友",
		},
	},
	["global_plugin_database"] = {
		["DETAILS_PLUGIN_ENCOUNTER_DETAILS"] = {
			["encounter_timers_bw"] = {
			},
			["encounter_timers_dbm"] = {
			},
		},
	},
	["savedCustomSpells"] = {
		{
			422779, -- [1]
			"燃燒狂亂 (4P)", -- [2]
			"Interface\\Addons\\Details\\images\\spells\\burning_frenzy_tier4.jpg", -- [3]
		}, -- [1]
		{
			7, -- [1]
			"環境 (岩漿)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [2]
		{
			1, -- [1]
			"近戰", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [3]
		{
			2, -- [1]
			"自動射擊", -- [2]
			"Interface\\ICONS\\INV_Weapon_Bow_07", -- [3]
		}, -- [4]
		{
			4, -- [1]
			"環境 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [5]
		{
			8, -- [1]
			"環境 (黏液)", -- [2]
			"Interface\\ICONS\\Ability_Creature_Poison_02", -- [3]
		}, -- [6]
		{
			424428, -- [1]
			"爆發 (4P)", -- [2]
			"Interface\\Addons\\Details\\images\\spells\\eruption_tier4.jpg", -- [3]
		}, -- [7]
		{
			395296, -- [1]
			"黯黑力量 (on your self)", -- [2]
			"Interface\\Addons\\Details\\images\\ebon_might", -- [3]
		}, -- [8]
		{
			5, -- [1]
			"環境 (疲勞)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [9]
		{
			196917, -- [1]
			"殉難者之光 (傷害)", -- [2]
			1360762, -- [3]
		}, -- [10]
		{
			77535, -- [1]
			"血魄護盾", -- [2]
			"Interface\\Addons\\Details\\images\\icon_blood_shield", -- [3]
		}, -- [11]
		{
			3, -- [1]
			"環境 (墜落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [12]
		{
			6, -- [1]
			"環境 (著火)", -- [2]
			"Interface\\ICONS\\INV_SummerFest_FireSpirit", -- [3]
		}, -- [13]
		{
			98021, -- [1]
			"生命交換", -- [2]
			237586, -- [3]
		}, -- [14]
		{
			108271, -- [1]
			"星界轉移", -- [2]
			"Interface\\Addons\\Details\\images\\icon_astral_shift", -- [3]
		}, -- [15]
		{
			425701, -- [1]
			"|T5415954:14:14:0:0:14:14:1:12:1:12|t 菲拉卡的腐化�", -- [2]
			4914678, -- [3]
		}, -- [16]
		{
			382426, -- [1]
			"|T4638591:14:14:0:0:14:14:1:12:1:12|t 惡意風暴", -- [2]
			572029, -- [3]
		}, -- [17]
		{
			418527, -- [1]
			"|T254116:14:14:0:0:14:14:1:12:1:12|t 破碎明日之鏡", -- [2]
			254116, -- [3]
		}, -- [18]
		{
			381475, -- [1]
			"|T4638721:14:14:0:0:14:14:1:12:1:12|t 爆發長矛碎片", -- [2]
			4638721, -- [3]
		}, -- [19]
		{
			423611, -- [1]
			"|T1357807:14:14:0:0:14:14:1:12:1:12|t 燼魂之塵 *proc*", -- [2]
			1357807, -- [3]
		}, -- [20]
		{
			417452, -- [1]
			"|T1391676:14:14:0:0:14:14:1:12:1:12|t 加速沙漏", -- [2]
			1391676, -- [3]
		}, -- [21]
		{
			377451, -- [1]
			"|T4643989:14:14:0:0:14:14:1:12:1:12|t 魔法冰凍球", -- [2]
			4643989, -- [3]
		}, -- [22]
		{
			417458, -- [1]
			"|T1391676:14:14:0:0:14:14:1:12:1:12|t 加速沙漏", -- [2]
			1391676, -- [3]
		}, -- [23]
		{
			382090, -- [1]
			"|T4554454:14:14:0:0:14:14:1:12:1:12|t 噬風者的恩澤", -- [2]
			4554454, -- [3]
		}, -- [24]
		{
			214342, -- [1]
			"|T443378:14:14:0:0:14:14:1:12:1:12|t 夢魘蛋殼", -- [2]
			1029595, -- [3]
		}, -- [25]
		{
			429272, -- [1]
			"|T237424:14:14:0:0:14:14:1:12:1:12|t 遠古保衛者之� (*vers*)", -- [2]
			463540, -- [3]
		}, -- [26]
		{
			389839, -- [1]
			"|T4509422:14:14:0:0:14:14:1:12:1:12|t 晶紅幼龍之殼", -- [2]
			4572404, -- [3]
		}, -- [27]
		{
			401428, -- [1]
			"|T3853931:14:14:0:0:14:14:1:12:1:12|t 灼熱暗影之瓶", -- [2]
			4914678, -- [3]
		}, -- [28]
		{
			214200, -- [1]
			"|T535593:14:14:0:0:14:14:1:12:1:12|t 崇聖微粒", -- [2]
			237541, -- [3]
		}, -- [29]
		{
			215407, -- [1]
			"|T1362635:14:14:0:0:14:14:1:12:1:12|t 籠困恐懼", -- [2]
			136141, -- [3]
		}, -- [30]
		{
			377459, -- [1]
			"|T4638565:14:14:0:0:14:14:1:12:1:12|t 大師的全圖騰", -- [2]
			135829, -- [3]
		}, -- [31]
		{
			426672, -- [1]
			"|T5351062:14:14:0:0:14:14:1:12:1:12|t 皮波的翡翠友� (vers)", -- [2]
			"Interface\\AddOns\\Details\\images\\spells\\spell_druid_bearhug_blackwhite.jpg", -- [3]
		}, -- [32]
		{
			424324, -- [1]
			"|T5176956:14:14:0:0:14:14:1:12:1:12|t 『暗影煉獄』�", -- [2]
			4914677, -- [3]
		}, -- [33]
		{
			429271, -- [1]
			"|T237424:14:14:0:0:14:14:1:12:1:12|t 遠古保衛者之�", -- [2]
			237424, -- [3]
		}, -- [34]
		{
			265953, -- [1]
			"|T134543:14:14:0:0:14:14:1:12:1:12|t 米達斯咒符", -- [2]
			132983, -- [3]
		}, -- [35]
		{
			382135, -- [1]
			"|T650636:14:14:0:0:14:14:1:12:1:12|t 『狂躁』哀炬", -- [2]
			650636, -- [3]
		}, -- [36]
		{
			429257, -- [1]
			"|T133749:14:14:0:0:14:14:1:12:1:12|t 枯木的樹枝", -- [2]
			133749, -- [3]
		}, -- [37]
		{
			426898, -- [1]
			"|T1357807:14:14:0:0:14:14:1:12:1:12|t 燼魂之塵 *on use*", -- [2]
			1357807, -- [3]
		}, -- [38]
		{
			384290, -- [1]
			"|T443377:14:14:0:0:14:14:1:12:1:12|t 致狂豺狼人信�", -- [2]
			132101, -- [3]
		}, -- [39]
		{
			426486, -- [1]
			"|T1045108:14:14:0:0:14:14:1:12:1:12|t 熾熱精華", -- [2]
			5171363, -- [3]
		}, -- [40]
		{
			384325, -- [1]
			"|T443377:14:14:0:0:14:14:1:12:1:12|t 致狂豺狼人信�", -- [2]
			135860, -- [3]
		}, -- [41]
		{
			427209, -- [1]
			"|T5263786:14:14:0:0:14:14:1:12:1:12|t 縛夢者，偉大�", -- [2]
			5263786, -- [3]
		}, -- [42]
		{
			426647, -- [1]
			"|T5351062:14:14:0:0:14:14:1:12:1:12|t 皮波的翡翠友� (mast)", -- [2]
			"Interface\\AddOns\\Details\\images\\spells\\lil_dragon_left.jpg", -- [3]
		}, -- [43]
		{
			426648, -- [1]
			"|T5351062:14:14:0:0:14:14:1:12:1:12|t 皮波的翡翠友� (*mast*)", -- [2]
			5342919, -- [3]
		}, -- [44]
		{
			426553, -- [1]
			"|T5140836:14:14:0:0:14:14:1:12:1:12|t 洪荒烈焰占卜�", -- [2]
			5140836, -- [3]
		}, -- [45]
		{
			426564, -- [1]
			"|T5140836:14:14:0:0:14:14:1:12:1:12|t 洪荒烈焰占卜�", -- [2]
			5140836, -- [3]
		}, -- [46]
		{
			426676, -- [1]
			"|T5351062:14:14:0:0:14:14:1:12:1:12|t 皮波的翡翠友� (crit)", -- [2]
			"Interface\\AddOns\\Details\\images\\spells\\elf_face_right.jpg", -- [3]
		}, -- [47]
		{
			429221, -- [1]
			"|T132779:14:14:0:0:14:14:1:12:1:12|t 海之星", -- [2]
			237311, -- [3]
		}, -- [48]
		{
			214169, -- [1]
			"|T1120362:14:14:0:0:14:14:1:12:1:12|t 尖刺平衡錘", -- [2]
			132340, -- [3]
		}, -- [49]
		{
			214350, -- [1]
			"|T1357816:14:14:0:0:14:14:1:12:1:12|t 橡心的瘤根", -- [2]
			1357816, -- [3]
		}, -- [50]
		{
			429262, -- [1]
			"|T133749:14:14:0:0:14:14:1:12:1:12|t 枯木的樹枝", -- [2]
			132852, -- [3]
		}, -- [51]
		{
			425127, -- [1]
			"|T5189457:14:14:0:0:14:14:1:12:1:12|t 殘酷夢境切肉�", -- [2]
			3152605, -- [3]
		}, -- [52]
		{
			382097, -- [1]
			"|T4638708:14:14:0:0:14:14:1:12:1:12|t 震盪紅晶", -- [2]
			1016245, -- [3]
		}, -- [53]
		{
			388855, -- [1]
			"|T4638394:14:14:0:0:14:14:1:12:1:12|t 迷你歌唱石", -- [2]
			4638394, -- [3]
		}, -- [54]
		{
			214985, -- [1]
			"|T519378:14:14:0:0:14:14:1:12:1:12|t 風痕磨石", -- [2]
			1029585, -- [3]
		}, -- [55]
		{
			408682, -- [1]
			"|T4624639:14:14:0:0:14:14:1:12:1:12|t 龍火炸彈箱", -- [2]
			4624639, -- [3]
		}, -- [56]
		{
			427161, -- [1]
			"|T5177651:14:14:0:0:14:14:1:12:1:12|t 奈木的崩壞紡�", -- [2]
			5177651, -- [3]
		}, -- [57]
		{
			426431, -- [1]
			"|T1045108:14:14:0:0:14:14:1:12:1:12|t 熾熱精華", -- [2]
			5171363, -- [3]
		}, -- [58]
		{
			381760, -- [1]
			"|T538042:14:14:0:0:14:14:1:12:1:12|t 突變熔岩猛瑪�", -- [2]
			538042, -- [3]
		}, -- [59]
		{
			427037, -- [1]
			"|T133262:14:14:0:0:14:14:1:12:1:12|t 盤蛇塑像", -- [2]
			133262, -- [3]
		}, -- [60]
		{
			408815, -- [1]
			"|T4823024:14:14:0:0:14:14:1:12:1:12|t 『長老烈焰之�", -- [2]
			136243, -- [3]
		}, -- [61]
		{
			214052, -- [1]
			"|T136030:14:14:0:0:14:14:1:12:1:12|t 斯寇瓦德之眼", -- [2]
			135799, -- [3]
		}, -- [62]
		{
			387036, -- [1]
			"|T4638716:14:14:0:0:14:14:1:12:1:12|t 凱拉卡的灼熱�", -- [2]
			460952, -- [3]
		}, -- [63]
		{
			401324, -- [1]
			"|T2356069:14:14:0:0:14:14:1:12:1:12|t 源質袖珍鐵砧", -- [2]
			4914678, -- [3]
		}, -- [64]
		{
			421994, -- [1]
			"|T4643994:14:14:0:0:14:14:1:12:1:12|t 熊族復仇的餽�", -- [2]
			4643994, -- [3]
		}, -- [65]
		{
			407961, -- [1]
			"|T134337:14:14:0:0:14:14:1:12:1:12|t 火成潮石", -- [2]
			1029721, -- [3]
		}, -- [66]
		{
			421996, -- [1]
			"|T4643994:14:14:0:0:14:14:1:12:1:12|t 熊族復仇的餽�", -- [2]
			4643994, -- [3]
		}, -- [67]
		{
			422441, -- [1]
			"|T959798:14:14:0:0:14:14:1:12:1:12|t 痛苦古樹木枝", -- [2]
			959798, -- [3]
		}, -- [68]
		{
			388755, -- [1]
			"|T2103807:14:14:0:0:14:14:1:12:1:12|t 憤恨怒羽", -- [2]
			2103807, -- [3]
		}, -- [69]
		{
			382056, -- [1]
			"|T1387353:14:14:0:0:14:14:1:12:1:12|t 烈焰裝飾", -- [2]
			1387353, -- [3]
		}, -- [70]
		{
			382058, -- [1]
			"|T1387353:14:14:0:0:14:14:1:12:1:12|t 烈焰裝飾", -- [2]
			1387353, -- [3]
		}, -- [71]
		{
			377455, -- [1]
			"|T237430:14:14:0:0:14:14:1:12:1:12|t 冰血死亡陷阱", -- [2]
			237430, -- [3]
		}, -- [72]
		{
			427430, -- [1]
			"|T4227435:14:14:0:0:14:14:1:12:1:12|t 扭刃彈藥包 *return*", -- [2]
			376022, -- [3]
		}, -- [73]
		{
			385903, -- [1]
			"|T237007:14:14:0:0:14:14:1:12:1:12|t 安珀斯庫的破�", -- [2]
			237007, -- [3]
		}, -- [74]
		{
			381967, -- [1]
			"|T1020391:14:14:0:0:14:14:1:12:1:12|t 電能掌控技巧", -- [2]
			1020391, -- [3]
		}, -- [75]
		{
			92174, -- [1]
			"|T237239:14:14:0:0:14:14:1:12:1:12|t 瓷蟹", -- [2]
			1508493, -- [3]
		}, -- [76]
		{
			425181, -- [1]
			"|T4955925:14:14:0:0:14:14:1:12:1:12|t 荊棘召喚者之� (*aoe*)", -- [2]
			415052, -- [3]
		}, -- [77]
		{
			401306, -- [1]
			"|T2356069:14:14:0:0:14:14:1:12:1:12|t 源質袖珍鐵砧", -- [2]
			2356069, -- [3]
		}, -- [78]
		{
			271671, -- [1]
			"|T454048:14:14:0:0:14:14:1:12:1:12|t 威奎斯特夫人�", -- [2]
			454048, -- [3]
		}, -- [79]
		{
			384004, -- [1]
			"|T1029000:14:14:0:0:14:14:1:12:1:12|t 家園襲擊號角", -- [2]
			252172, -- [3]
		}, -- [80]
		{
			422146, -- [1]
			"|T516743:14:14:0:0:14:14:1:12:1:12|t 『喚日者』貝�", -- [2]
			4555669, -- [3]
		}, -- [81]
		{
			425509, -- [1]
			"|T959798:14:14:0:0:14:14:1:12:1:12|t 痛苦古樹木枝", -- [2]
			959798, -- [3]
		}, -- [82]
		{
			425154, -- [1]
			"|T646683:14:14:0:0:14:14:1:12:1:12|t 災變璽戒烙印", -- [2]
			135265, -- [3]
		}, -- [83]
		{
			213786, -- [1]
			"|T1362631:14:14:0:0:14:14:1:12:1:12|t 腐化星輝", -- [2]
			236168, -- [3]
		}, -- [84]
		{
			270827, -- [1]
			"|T463924:14:14:0:0:14:14:1:12:1:12|t 輕浮暗影容器", -- [2]
			237431, -- [3]
		}, -- [85]
		{
			417534, -- [1]
			"|T922527:14:14:0:0:14:14:1:12:1:12|t 時間小偷之策", -- [2]
			922527, -- [3]
		}, -- [86]
		{
			394453, -- [1]
			"|T4638576:14:14:0:0:14:14:1:12:1:12|t 戴恩娜之選的�", -- [2]
			514016, -- [3]
		}, -- [87]
		{
			424965, -- [1]
			"|T4955925:14:14:0:0:14:14:1:12:1:12|t 荊棘召喚者之�", -- [2]
			415052, -- [3]
		}, -- [88]
		{
			388739, -- [1]
			"|T4635246:14:14:0:0:14:14:1:12:1:12|t 純粹腐朽塑像", -- [2]
			4635246, -- [3]
		}, -- [89]
		{
			402583, -- [1]
			"|T4914670:14:14:0:0:14:14:1:12:1:12|t 異界信標", -- [2]
			4914670, -- [3]
		}, -- [90]
		{
			429246, -- [1]
			"|T132108:14:14:0:0:14:14:1:12:1:12|t 凝固的傑那索�", -- [2]
			132108, -- [3]
		}, -- [91]
		{
			215270, -- [1]
			"|T457655:14:14:0:0:14:14:1:12:1:12|t 融合體的第七�", -- [2]
			463284, -- [3]
		}, -- [92]
		{
			388948, -- [1]
			"|T609814:14:14:0:0:14:14:1:12:1:12|t 鋸齒冰球", -- [2]
			629077, -- [3]
		}, -- [93]
		{
			397376, -- [1]
			"|T4638716:14:14:0:0:14:14:1:12:1:12|t 凱拉卡的灼熱�", -- [2]
			460952, -- [3]
		}, -- [94]
		{
			422303, -- [1]
			"|T4227435:14:14:0:0:14:14:1:12:1:12|t 扭刃彈藥包 *throw*", -- [2]
			376022, -- [3]
		}, -- [95]
		{
			383934, -- [1]
			"|T839910:14:14:0:0:14:14:1:12:1:12|t 水之跳動心臟", -- [2]
			839910, -- [3]
		}, -- [96]
	},
	["keystone_cache"] = {
	},
	["breakdown_spell_tab"] = {
		["blockspell_padding"] = 5,
		["spellcontainer_height"] = 311,
		["blockspell_height"] = 67,
		["blockspell_backgroundcolor"] = {
			0.05, -- [1]
			0.05, -- [2]
			0.05, -- [3]
			0.2, -- [4]
		},
		["phasecontainer_islocked"] = true,
		["blockspell_spark_color"] = {
			1, -- [1]
			1, -- [2]
			1, -- [3]
			0.7, -- [4]
		},
		["blockcontainer_width"] = 456,
		["spellbar_background_alpha"] = 0.92,
		["spellcontainer_width"] = 429.0000915527344,
		["spellcontainer_header_fontcolor"] = {
			1, -- [1]
			1, -- [2]
			1, -- [3]
			1, -- [4]
		},
		["phasecontainer_height"] = 140,
		["phasecontainer_enabled"] = true,
		["genericcontainer_headers_right"] = {
		},
		["phasecontainer_width"] = 290.0000610351563,
		["phasecontainer_headers"] = {
		},
		["statusbar_texture"] = "Interface\\AddOns\\Details\\images\\bar_skyline",
		["spellcontainer_islocked"] = true,
		["nest_pet_spells_by_caster"] = true,
		["blockspell_bordercolor"] = {
			0, -- [1]
			0, -- [2]
			0, -- [3]
			0.7, -- [4]
		},
		["targetcontainer_headers"] = {
		},
		["blockspell_spark_width"] = 4,
		["genericcontainer_width"] = 429,
		["spellcontainer_header_height"] = 20,
		["blockcontainer_islocked"] = true,
		["genericcontainer_right_width"] = 403,
		["blockspell_color"] = {
			0.6, -- [1]
			0.6, -- [2]
			0.6, -- [3]
			0.55, -- [4]
		},
		["blockspell_spark_show"] = true,
		["spellcontainer_header_fontsize"] = 10,
		["statusbar_background_color"] = {
			0.15, -- [1]
			0.15, -- [2]
			0.15, -- [3]
		},
		["targetcontainer_width"] = 429.0000915527344,
		["genericcontainer_islocked"] = true,
		["genericcontainer_right_height"] = 460,
		["statusbar_alpha"] = 0.7,
		["targetcontainer_height"] = 140,
		["nest_pet_spells_by_name"] = false,
		["nest_players_spells_with_same_name"] = true,
		["blockspell_spark_offset"] = -1,
		["genericcontainer_enabled"] = true,
		["genericcontainer_headers"] = {
		},
		["blockcontainer_height"] = 270.0000305175781,
		["statusbar_background_alpha"] = 0.7,
		["spellcontainer_headers"] = {
		},
		["targetcontainer_islocked"] = true,
		["genericcontainer_height"] = 481,
	},
	["always_use_profile_name"] = "",
	["profile_by_spec"] = {
	},
	["combat_id_global"] = 12,
	["displays_by_spec"] = {
	},
	["plugin_window_pos"] = {
		["y"] = 7.62939453125e-06,
		["x"] = 0,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["userCustomSpells"] = {
	},
	["last_changelog_size"] = 28274,
	["immersion_unit_special_icons"] = true,
	["lastUpdateWarning"] = 0,
	["npcid_pool"] = {
		[210147] = "焚化使者",
		[207090] = "薩克利岩翼蝠",
		[209090] = "丁卓爾‧睿迅",
		[207796] = "燃燒巨像",
		[207087] = "薩克利毀樹者",
		[200926] = "『殘暴者』伊吉拉",
		[210172] = "薩克利重戰士",
		[212327] = "薩克利焰法師",
		[200927] = "斯莫德隆",
		[210231] = "污染的鞭笞者 <瘤根>",
		[210173] = "薩克利塑鋼者",
		[210150] = "焰觸執行者",
		[214608] = "哀嚎的靈魂",
		[0] = "[*] 暗言術：死",
		[207341] = "極熾之矛",
		[204931] = "菲拉卡",
		[209333] = "瘤根",
		[210170] = "薩克利焰法師",
		[211306] = "熾炎藤蔓",
	},
	["death_recap"] = {
		["show_segments"] = false,
		["enabled"] = true,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["user_is_patreon_supporter"] = false,
	["spell_pool"] = {
		2, -- [1]
		3, -- [2]
		"環境 (墜落)", -- [3]
		[193473] = "虛無觸鬚 <瑪托雅奶奶>",
		[280375] = 2,
		[389890] = 12,
		[115192] = 4,
		[419061] = "菲拉卡",
		[183752] = 12,
		[104318] = "狂野小鬼 <斯巴達無畏>",
		[171982] = 9,
		[387847] = 9,
		[387336] = 3,
		[430324] = "瘤根",
		[271682] = 10,
		[425719] = 6,
		[422137] = "菲拉卡",
		[214459] = 4,
		[376080] = 1,
		[145629] = 6,
		[425721] = 6,
		[216251] = 7,
		[115450] = 10,
		[275779] = 2,
		[414976] = 1,
		[370966] = 12,
		[48018] = 9,
		[120696] = 5,
		[227255] = 12,
		[118905] = "電容圖騰 <蒜頭叔>",
		[6552] = 1,
		[388367] = 6,
		[427773] = 4,
		[370969] = 12,
		[162264] = 12,
		[370970] = 12,
		[22482] = 4,
		[422146] = 9,
		[335150] = 6,
		[421636] = "丁卓爾‧睿迅",
		[57934] = 4,
		[394003] = 6,
		[378139] = 7,
		[118779] = 1,
		[196810] = "神聖影像 <野比伸助>",
		[400145] = 10,
		[205766] = 8,
		[64843] = 5,
		[400146] = 10,
		[388376] = 6,
		[196555] = 12,
		[196811] = "神聖影像 <野比伸助>",
		[1719] = 1,
		[203720] = 12,
		[44949] = 1,
		[196812] = "神聖影像 <野比伸助>",
		[114942] = "療癒之潮圖騰 <蒜頭叔>",
		[388380] = 2,
		[196813] = "神聖影像 <野比伸助>",
		[35546] = 4,
		[245686] = 7,
		[370984] = "巨龍波音波音",
		[196816] = "神聖影像 <野比伸助>",
		[357170] = "巨龍波音波音",
		[377129] = 2,
		[390435] = 6,
		[391459] = 6,
		[377642] = 6,
		[81297] = 2,
		[372014] = "巨龍波音波音",
		[421656] = "斯莫德隆",
		[426262] = "巨龍波音波音",
		[7384] = 1,
		[114050] = 7,
		[465] = 2,
		[364343] = "巨龍波音波音",
		[107270] = 10,
		[392490] = 6,
		[422172] = "斯莫德隆",
		[320334] = 12,
		[201427] = 12,
		[204242] = 2,
		[418080] = 5,
		[201428] = 12,
		[426269] = "巨龍波音波音",
		[24275] = 2,
		[381748] = "巨龍波音波音",
		[114052] = 7,
		[198103] = 7,
		[347462] = 12,
		[374585] = 6,
		[377656] = 6,
		[393009] = 12,
		[422691] = "斯莫德隆",
		[423715] = "『殘暴者』伊吉拉",
		[390964] = 5,
		[421158] = 5,
		[325461] = 6,
		[52437] = 1,
		[383290] = 1,
		[327510] = 2,
		[405808] = 10,
		[195292] = 6,
		[325464] = 6,
		[208086] = 1,
		[391481] = 6,
		[19574] = 3,
		[423211] = 1,
		[390971] = 5,
		[260798] = 1,
		[393019] = 2,
		[381761] = 7,
		[255937] = 2,
		[358733] = "巨龍波音波音",
		[400185] = 9,
		[425261] = 2,
		[423726] = 5,
		[420144] = 3,
		[396092] = 6,
		[425262] = 2,
		[387393] = 9,
		[48792] = 6,
		[392511] = 5,
		[2050] = 5,
		[321379] = 5,
		[426288] = 2,
		[390978] = 5,
		[426289] = 6,
		[188389] = 7,
		[205021] = 8,
		[2094] = 4,
		[2098] = 4,
		[527] = 5,
		[370511] = 12,
		[423734] = "末日惡魔 <斯巴達無畏>",
		[403265] = "Katachi-屠魔山谷",
		[389448] = "色色發抖 <狩熊>",
		[387402] = 9,
		[357209] = "巨龍波音波音",
		[86040] = 9,
		[408385] = 2,
		[426297] = 7,
		[192231] = "岩漿圖騰 <蒜頭叔>",
		[393035] = 12,
		[383312] = 6,
		[235219] = 8,
		[383313] = 6,
		[382290] = 8,
		[153596] = 8,
		[200166] = 12,
		[118922] = 3,
		[11327] = 4,
		[372571] = "Katachi-屠魔山谷",
		[424258] = 2,
		[585] = 5,
		[586] = 5,
		[426306] = 6,
		[424771] = "焚化使者",
		[589] = 5,
		[236502] = 7,
		[91800] = "復活的食屍鬼 <你這樣太快了>",
		[425796] = "焚化使者",
		[395603] = 2,
		[596] = 5,
		[419144] = "菲拉卡",
		[190446] = 8,
		[50842] = 6,
		[199658] = 1,
		[77472] = 7,
		[34914] = 5,
		[392537] = 1,
		[426313] = 6,
		[428361] = 12,
		[428362] = 12,
		[124682] = 10,
		[427339] = "丁卓爾‧睿迅",
		[415569] = 4,
		[428363] = 12,
		[210152] = 12,
		[378213] = "巨龍波音波音",
		[370537] = "巨龍波音波音",
		[215270] = 5,
		[383843] = 2,
		[210153] = 12,
		[642] = 2,
		[377192] = 6,
		[426321] = 7,
		[45470] = 6,
		[426322] = "巨龍波音波音",
		[382824] = 8,
		[377195] = 6,
		[425300] = "薩克利焰法師",
		[377708] = 12,
		[405345] = 2,
		[360823] = "巨龍波音波音",
		[428886] = "[*] 火焰光束",
		[199667] = 1,
		[347008] = "维尼克古里尔 <斯巴達無畏>",
		[362361] = "巨龍波音波音",
		[423260] = "丁卓爾‧睿迅",
		[686] = 9,
		[385391] = 1,
		[405350] = 2,
		[360828] = 2,
		[422750] = 2,
		[383346] = 2,
		[406887] = 8,
		[370553] = "巨龍波音波音",
		[362877] = "巨龍波音波音",
		[423264] = "丁卓爾‧睿迅",
		[77478] = 7,
		[385907] = 4,
		[423265] = "丁卓爾‧睿迅",
		[288675] = 7,
		[423266] = "丁卓爾‧睿迅",
		[311193] = 1,
		[422243] = "斯莫德隆",
		[200183] = 5,
		[184575] = 2,
		[371070] = 1,
		[33702] = 9,
		[426341] = 9,
		[394101] = 2,
		[370562] = "巨龍波音波音",
		[424808] = "焚化使者",
		[359816] = "巨龍波音波音",
		[57755] = 1,
		[41635] = 5,
		[117014] = 7,
		[388479] = 5,
		[363916] = "巨龍波音波音",
		[415603] = 9,
		[118038] = 1,
		[337819] = 12,
		[193538] = 4,
		[47585] = 5,
		[392067] = 2,
		[781] = 3,
		[52127] = 7,
		[262115] = 1,
		[213243] = 12,
		[422776] = "『殘暴者』伊吉拉",
		[85416] = 2,
		[218617] = 1,
		[212988] = 12,
		[21562] = 5,
		[228597] = 8,
		[57821] = 6,
		[377234] = 6,
		[185099] = 10,
		[85673] = 2,
		[56222] = 6,
		[108446] = 9,
		[391054] = 2,
		[427901] = 12,
		[115867] = 10,
		[388497] = 10,
		[228600] = 8,
		[267213] = 9,
		[406921] = 7,
		[425345] = "菲拉卡",
		[427904] = 12,
		[53600] = 2,
		[385941] = 6,
		[427905] = 12,
		[427906] = 12,
		[424324] = 7,
		[394131] = 4,
		[359844] = 3,
		[393108] = 2,
		[178963] = 12,
		[427908] = 12,
		[281036] = 3,
		[406927] = 3,
		[160029] = 6,
		[404369] = "Katachi-屠魔山谷",
		[427910] = 12,
		[232698] = 5,
		[427911] = 12,
		[264663] = 3,
		[427912] = 12,
		[420236] = "丁卓爾‧睿迅",
		[427913] = 12,
		[420237] = "丁卓爾‧睿迅",
		[427914] = 12,
		[77489] = 5,
		[420240] = "丁卓爾‧睿迅",
		[419217] = "菲拉卡",
		[414103] = 8,
		[204301] = 2,
		[404381] = "Katachi-屠魔山谷",
		[228354] = 8,
		[411547] = 1,
		[419737] = 3,
		[383915] = 1,
		[378286] = 2,
		[315341] = 4,
		[132403] = 2,
		[397734] = 6,
		[427928] = "丁卓爾‧睿迅",
		[101033] = 7,
		[400806] = 1,
		[424347] = "『殘暴者』伊吉拉",
		[114083] = 7,
		[228358] = 8,
		[387502] = "维尼克古里尔 <斯巴達無畏>",
		[32375] = 5,
		[422303] = 12,
		[264173] = 9,
		[203796] = 12,
		[424352] = "瘤根",
		[34861] = 5,
		[209426] = 12,
		[396719] = 1,
		[407466] = 5,
		[426401] = 5,
		[404908] = 9,
		[407467] = 2,
		[11426] = 8,
		[264178] = 9,
		[265202] = 5,
		[31224] = 4,
		[157997] = 8,
		[143924] = 2,
		[428964] = "燃燒巨像",
		[213011] = 12,
		[427430] = 12,
		[388539] = 1,
		[201754] = "色色發抖 <狩熊>",
		[375234] = "Katachi-屠魔山谷",
		[111400] = 9,
		[391099] = 5,
		[215572] = 1,
		[132157] = 5,
		[32216] = 1,
		[148022] = 8,
		[411060] = 6,
		[424366] = "瘤根",
		[263165] = 5,
		[395197] = 7,
		[424368] = "Katachi-屠魔山谷",
		[188196] = 7,
		[388035] = "色色發抖 <狩熊>",
		[195617] = 6,
		[49576] = 6,
		[1044] = 2,
		[422836] = "菲拉卡",
		[257284] = 3,
		[422837] = "菲拉卡",
		[391109] = 5,
		[1064] = 7,
		[100784] = 10,
		[2139] = 8,
		[422839] = "菲拉卡",
		[406975] = 2,
		[55078] = 6,
		[8676] = 4,
		[184362] = 1,
		[53351] = 3,
		[388555] = 10,
		[43308] = 2,
		[374227] = "巨龍波音波音",
		[362969] = "Katachi-屠魔山谷",
		[353759] = "巨龍波音波音",
		[184364] = 1,
		[408005] = "Katachi-屠魔山谷",
		[414658] = 8,
		[32409] = "[*] 暗言術：死",
		[388048] = 10,
		[406983] = 2,
		[193065] = 5,
		[343527] = 2,
		[116267] = 8,
		[426431] = 5,
		[414661] = 8,
		[73920] = 7,
		[405963] = 5,
		[291843] = 6,
		[396752] = 1,
		[184367] = 1,
		[373213] = 5,
		[394195] = 8,
		[73921] = 7,
		[2383] = 1,
		[195627] = 4,
		[75] = 3,
		[419273] = 5,
		[97462] = 1,
		[390105] = 10,
		[157503] = 7,
		[425417] = 9,
		[371172] = 4,
		[157504] = 7,
		[97463] = 1,
		[207400] = 7,
		[419279] = "Katachi-屠魔山谷",
		[203819] = 12,
		[370665] = "Katachi-屠魔山谷",
		[321538] = "色色發抖 <狩熊>",
		[108211] = 4,
		[363502] = "巨龍波音波音",
		[77762] = 7,
		[409560] = "Katachi-屠魔山谷",
		[264735] = 3,
		[273947] = 6,
		[388068] = 9,
		[374251] = "巨龍波音波音",
		[382440] = 8,
		[388070] = 9,
		[344572] = "色色發抖 <狩熊>",
		[2643] = 3,
		[383978] = 1,
		[207150] = 6,
		[51052] = 6,
		[31707] = "水元素 <天兵法師>",
		[382445] = 8,
		[346111] = 5,
		[75973] = 1,
		[386540] = 8,
		[289308] = 8,
		[107574] = 1,
		[390636] = 5,
		[32379] = 5,
		[97340] = 12,
		[423904] = "斯莫德隆",
		[421858] = 2,
		[385013] = 1,
		[410089] = "Katachi-屠魔山谷",
		[210738] = 6,
		[97341] = 3,
		[204598] = 12,
		[388599] = 2,
		[430051] = "哀嚎的靈魂",
		[374271] = 6,
		[430052] = "哀嚎的靈魂",
		[1464] = 1,
		[390137] = 12,
		[376832] = "巨龍波音波音",
		[383485] = 1,
		[1490] = 12,
		[2983] = 4,
		[426474] = 10,
		[425451] = "丁卓爾‧睿迅",
		[424428] = "Katachi-屠魔山谷",
		[194879] = 6,
		[391166] = 12,
		[77130] = 7,
		[199486] = 5,
		[390145] = 12,
		[385540] = 3,
		[396288] = "Katachi-屠魔山谷",
		[391171] = 12,
		[390148] = "巨龍波音波音",
		[391172] = 12,
		[379403] = 12,
		[425461] = 2,
		[426486] = 3,
		[59052] = 6,
		[423416] = 1,
		[100] = 1,
		[55342] = 8,
		[379407] = 12,
		[59628] = 4,
		[403460] = 2,
		[373267] = "巨龍波音波音",
		[390155] = 12,
		[404996] = 2,
		[373268] = "巨龍波音波音",
		[225080] = 7,
		[361500] = "巨龍波音波音",
		[385042] = 1,
		[322098] = 5,
		[424960] = "薩克利焰法師",
		[212800] = 12,
		[268877] = 3,
		[185422] = 4,
		[196937] = 4,
		[62124] = 2,
		[118459] = "色色發抖 <狩熊>",
		[424965] = 12,
		[325174] = 7,
		[361509] = "巨龍波音波音",
		[391191] = 12,
		[425479] = 7,
		[421898] = "瘤根",
		[384029] = 2,
		[193358] = 4,
		[417806] = "菲拉卡",
		[322109] = 10,
		[193359] = 4,
		[417807] = "菲拉卡",
		[116670] = 10,
		[1766] = 4,
		[205386] = 5,
		[423439] = 10,
		[188499] = 12,
		[375335] = 6,
		[274009] = 6,
		[385059] = 1,
		[424464] = 7,
		[407065] = 2,
		[385060] = 1,
		[184662] = 2,
		[104773] = 9,
		[385061] = 1,
		[406043] = "Katachi-屠魔山谷",
		[182104] = 2,
		[385062] = 1,
		[91340] = 1,
		[162402] = 6,
		[322118] = 10,
		[410651] = "Katachi-屠魔山谷",
		[421398] = "丁卓爾‧睿迅",
		[383017] = 7,
		[383018] = 7,
		[375342] = 6,
		[422935] = "菲拉卡",
		[387113] = 2,
		[375343] = 9,
		[387626] = 9,
		[51124] = 6,
		[271971] = "恐懼潛獵犬 <斯巴達無畏>",
		[409632] = 9,
		[117313] = 1,
		[31935] = 2,
		[61999] = 6,
		[52212] = 6,
		[331850] = 4,
		[135029] = "水元素 <天兵法師>",
		[391215] = 12,
		[390192] = 12,
		[426527] = 4,
		[20549] = 2,
		[404523] = 7,
		[211793] = 6,
		[421923] = "菲拉卡",
		[387636] = 9,
		[394289] = 5,
		[389684] = 10,
		[378426] = 4,
		[389685] = 10,
		[390197] = 12,
		[425509] = 6,
		[1966] = 4,
		[397364] = 1,
		[31616] = 7,
		[246851] = 3,
		[426535] = 12,
		[325209] = 10,
		[53365] = 6,
		[13877] = 4,
		[413231] = 5,
		[246852] = 3,
		[425002] = "瘤根",
		[8004] = 7,
		[373316] = 5,
		[422956] = 5,
		[421421] = "瘤根",
		[246853] = 3,
		[373317] = 5,
		[205146] = 9,
		[8092] = 5,
		[246854] = 3,
		[388672] = 8,
		[424495] = "丁卓爾‧睿迅",
		[422961] = "『殘暴者』伊吉拉",
		[12294] = 1,
		[424497] = "熾炎藤蔓",
		[45242] = 5,
		[421939] = "丁卓爾‧睿迅",
		[424498] = "丁卓爾‧睿迅",
		[373835] = "巨龍波音波音",
		[315496] = 4,
		[424499] = "丁卓爾‧睿迅",
		[374348] = "巨龍波音波音",
		[376907] = 6,
		[414777] = "極熾之矛",
		[386631] = 1,
		[421942] = "菲拉卡",
		[386632] = 1,
		[386633] = 1,
		[382028] = 7,
		[392776] = 1,
		[386124] = 9,
		[211805] = 6,
		[426553] = 8,
		[392778] = 1,
		[139] = 5,
		[108366] = 9,
		[406086] = 2,
		[404551] = 7,
		[315508] = 4,
		[422464] = "污染的鞭笞者 <瘤根>",
		[390224] = 4,
		[335467] = 5,
		[55095] = 6,
		[383061] = "岩漿圖騰 <蒜頭叔>",
		[422466] = "污染的鞭笞者 <瘤根>",
		[427072] = 5,
		[179057] = 12,
		[428608] = 12,
		[382551] = 1,
		[355941] = "巨龍波音波音",
		[372829] = 3,
		[420422] = "菲拉卡",
		[294020] = 7,
		[280715] = 1,
		[426564] = 1,
		[375901] = 5,
		[270481] = "惡魔暴君 <斯巴達無畏>",
		[425030] = "薩克利重戰士",
		[421960] = "瘤根",
		[184689] = 2,
		[13750] = 4,
		[126664] = 1,
		[375904] = 5,
		[421450] = "斯莫德隆",
		[372834] = 3,
		[195181] = 6,
		[392793] = 1,
		[195182] = 6,
		[114255] = 5,
		[387678] = 8,
		[425548] = 9,
		[196718] = 12,
		[373862] = "巨龍波音波音",
		[361582] = 3,
		[421969] = "斯莫德隆",
		[98008] = 7,
		[361584] = 6,
		[80353] = 8,
		[421971] = "瘤根",
		[385126] = 2,
		[426578] = 7,
		[412761] = "菲拉卡",
		[387174] = 2,
		[420950] = "斯莫德隆",
		[413786] = 5,
		[423510] = 5,
		[390247] = 12,
		[113746] = 10,
		[387178] = 2,
		[430677] = "斯莫德隆",
		[280735] = 1,
		[403044] = 2,
		[173184] = 7,
		[386159] = 3,
		[425564] = 9,
		[44544] = 8,
		[15286] = 5,
		[425568] = 9,
		[421986] = "污染的鞭笞者 <瘤根>",
		[386164] = 1,
		[43265] = 6,
		[356995] = "巨龍波音波音",
		[367231] = "巨龍波音波音",
		[79206] = 7,
		[263858] = "晾莖莖 <狩熊>",
		[215267] = 5,
		[217200] = 3,
		[203981] = 12,
		[53385] = 2,
		[415676] = 5,
		[370816] = 6,
		[422503] = "丁卓爾‧睿迅",
		[425062] = "薩克利塑鋼者",
		[425574] = "斯莫德隆",
		[370817] = 6,
		[185245] = 12,
		[247456] = 12,
		[425575] = "斯莫德隆",
		[212084] = 12,
		[410223] = "菲拉卡",
		[187827] = 12,
		[274740] = 1,
		[206967] = 6,
		[180612] = 6,
		[271105] = 1,
		[199547] = 12,
		[274742] = 1,
		[410225] = "菲拉卡",
		[388220] = 10,
		[429672] = "菲拉卡",
		[191634] = 7,
		[281265] = 5,
		[391092] = 5,
		[396921] = 1,
		[383104] = 1,
		[198013] = 12,
		[429162] = "丁卓爾‧睿迅",
		[188290] = 6,
		[425957] = "瘤根",
		[285514] = 7,
		[118522] = 7,
		[260881] = 7,
		[173183] = 7,
		[426605] = 4,
		[424233] = "斯莫德隆",
		[116680] = 10,
		[422000] = "丁卓爾‧睿迅",
		[184709] = 1,
		[81256] = 6,
		[267964] = "维尼克古里尔 <斯巴達無畏>",
		[399497] = 10,
		[399510] = 10,
		[49088] = 6,
		[405810] = 10,
		[405809] = 10,
		[371339] = "巨龍波音波音",
		[400106] = 10,
		[405807] = 10,
		[210042] = 12,
		[57724] = 1,
		[197919] = 10,
		[389422] = 10,
		[409722] = 9,
		[191837] = 10,
		[12472] = 8,
		[199552] = 12,
		[128594] = 3,
		[6262] = 4,
		[400100] = 10,
		[197916] = 10,
		[197908] = 10,
		[422518] = "菲拉卡",
		[388663] = 10,
		[391568] = 6,
		[258883] = 12,
		[191877] = 7,
		[370607] = 5,
		[403264] = "Katachi-屠魔山谷",
		[65081] = 5,
		[424567] = 3,
		[260708] = 1,
		[273977] = 6,
		[115294] = 10,
		[369299] = "巨龍波音波音",
		[382093] = 12,
		[368276] = 5,
		[381931] = 7,
		[422522] = "菲拉卡",
		[343737] = "玉龍 <Solu>",
		[418999] = 12,
		[317614] = 6,
		[268998] = 8,
		[115175] = 10,
		[427641] = 12,
		[423458] = 10,
		[422524] = "菲拉卡",
		[425804] = 10,
		[197509] = "血蟲 <你這樣太快了>",
		[388480] = 10,
		[371350] = "巨龍波音波音",
		[399491] = 10,
		[198533] = "玉蛟雕像 <Solu>",
		[426108] = "瘤根",
		[371351] = "巨龍波音波音",
		[191840] = 10,
		[258920] = 12,
		[406139] = 10,
		[191894] = 10,
		[132463] = 10,
		[115310] = 10,
		[379029] = 8,
		[371353] = "巨龍波音波音",
		[119611] = 10,
		[258921] = 12,
		[228477] = 12,
		[203794] = 12,
		[423903] = 1,
		[312215] = 5,
		[419591] = 12,
		[424577] = "丁卓爾‧睿迅",
		[386196] = 1,
		[258922] = 12,
		[280776] = 1,
		[424578] = "丁卓爾‧睿迅",
		[420313] = "菲拉卡",
		[30213] = "维尼克古里尔 <斯巴達無畏>",
		[115804] = 1,
		[424579] = "丁卓爾‧睿迅",
		[132467] = 10,
		[271671] = 10,
		[414977] = 1,
		[85739] = 1,
		[355916] = "Katachi-屠魔山谷",
		[147362] = 3,
		[383169] = "巨龍波音波音",
		[424581] = "丁卓爾‧睿迅",
		[425093] = "薩克利塑鋼者",
		[391058] = 12,
		[422023] = "瘤根",
		[273104] = 4,
		[189112] = 12,
		[228478] = 12,
		[48707] = 6,
		[255941] = 2,
		[204021] = 12,
		[343727] = "暗影惡魔 <野比伸助>",
		[343295] = 6,
		[393879] = 2,
		[98021] = "靈魂連結圖騰 <蒜頭叔>",
		[186257] = 3,
		[422026] = "瘤根",
		[253597] = 6,
		[376788] = "巨龍波音波音",
		[421515] = "斯莫德隆",
		[422027] = "卡多雷之魂",
		[77535] = 6,
		[423414] = 1,
		[51714] = 6,
		[315584] = 4,
		[403876] = 2,
		[225919] = 12,
		[242551] = 5,
		[315585] = 4,
		[383648] = 7,
		[386652] = 2,
		[370666] = "Katachi-屠魔山谷",
		[370667] = "巨龍波音波音",
		[114911] = 7,
		[47528] = 6,
		[96231] = 2,
		[379] = 7,
		[198030] = 12,
		[423717] = "菲拉卡",
		[383389] = 2,
		[360022] = "巨龍波音波音",
		[384318] = 1,
		[36554] = 4,
		[52174] = 1,
		[417939] = 5,
		[410263] = "Katachi-屠魔山谷",
		[55233] = 6,
		[188443] = 7,
		[383269] = 6,
		[205196] = "恐懼潛獵犬 <斯巴達無畏>",
		[428962] = "燃燒巨像",
		[205708] = 2,
		[212105] = 12,
		[410265] = 9,
		[342857] = 12,
		[417789] = "[*] 燃焰",
		[351338] = "Katachi-屠魔山谷",
		[57984] = "大型火元素 <蒜頭叔>",
		[421013] = "瘤根",
		[265953] = 4,
		[212106] = 12,
		[386301] = 3,
		[421831] = "菲拉卡",
		[265954] = 4,
		[292463] = 2,
		[367230] = "巨龍波音波音",
		[375981] = 5,
		[425530] = "菲拉卡",
		[422039] = "瘤根",
		[425481] = "菲拉卡",
		[417431] = "菲拉卡",
		[360827] = "Katachi-屠魔山谷",
		[16827] = "色色發抖 <狩熊>",
		[228780] = 6,
		[114018] = 4,
		[386730] = 2,
		[384391] = 1,
		[426647] = 6,
		[375984] = 7,
		[186265] = 3,
		[370971] = 12,
		[428695] = "丁卓爾‧睿迅",
		[375985] = 7,
		[51460] = 6,
		[425492] = "菲拉卡",
		[84721] = 8,
		[427161] = 9,
		[421532] = "斯莫德隆",
		[366155] = "巨龍波音波音",
		[407475] = 2,
		[201363] = 1,
		[109304] = 3,
		[422277] = "斯莫德隆",
		[59638] = 8,
		[219788] = 6,
		[417630] = "菲拉卡",
		[221322] = 6,
		[403695] = 2,
		[201364] = 1,
		[228645] = 6,
		[270569] = 9,
		[414342] = "『殘暴者』伊吉拉",
		[428770] = "丁卓爾‧睿迅",
		[423583] = 9,
		[91776] = "復活的食屍鬼 <你這樣太快了>",
		[377245] = 6,
		[418978] = "菲拉卡",
		[423584] = 9,
		[258860] = 12,
		[49184] = 6,
		[382106] = 8,
		[27827] = 5,
		[195707] = 1,
		[404139] = 2,
		[202166] = 1,
		[417445] = "菲拉卡",
		[417957] = 5,
		[422115] = "丁卓爾‧睿迅",
		[363534] = "巨龍波音波音",
		[417446] = "菲拉卡",
		[162794] = 12,
		[81141] = 6,
		[414888] = "『殘暴者』伊吉拉",
		[392883] = 10,
		[422053] = "污染的鞭笞者 <瘤根>",
		[257946] = 3,
		[184707] = 1,
		[193357] = 4,
		[403631] = "Katachi-屠魔山谷",
		[227723] = 2,
		[64901] = 5,
		[5308] = 1,
		[377253] = 6,
		[6673] = 1,
		[422578] = "斯莫德隆",
		[425571] = 2,
		[426150] = "『殘暴者』伊吉拉",
		[423705] = "菲拉卡",
		[429221] = 7,
		[23881] = 1,
		[405681] = "维尼克古里尔 <斯巴達無畏>",
		[385723] = 2,
		[383329] = 2,
		[417452] = 6,
		[254474] = 2,
		[373442] = "屈心魔 <瑪托雅奶奶>",
		[357210] = "巨龍波音波音",
		[421693] = "菲拉卡",
		[25771] = 2,
		[424590] = 2,
		[196278] = 9,
		[399502] = "巨龍波音波音",
		[157122] = 2,
		[197834] = 4,
		[260734] = 7,
		[417455] = "菲拉卡",
		[417967] = 5,
		[30153] = "维尼克古里尔 <斯巴達無畏>",
		[382145] = 2,
		[417456] = 6,
		[198813] = 12,
		[376974] = 6,
		[292361] = 2,
		[419504] = "[*] 盛怒的烈焰",
		[390762] = 6,
		[424622] = 2,
		[212653] = 8,
		[417458] = 6,
		[370889] = "Katachi-屠魔山谷",
		[2061] = 5,
		[633] = 2,
		[419506] = "菲拉卡",
		[17] = 5,
		[381637] = 4,
		[53390] = 7,
		[424665] = "丁卓爾‧睿迅",
		[51271] = 6,
		[246152] = 3,
		[51399] = 6,
		[207771] = 12,
		[429782] = "菲拉卡",
		[192611] = 12,
		[416132] = "巨龍波音波音",
		[375583] = "Katachi-屠魔山谷",
		[371028] = 1,
		[426674] = 6,
		[429233] = 1,
		[381684] = 7,
		[214169] = 6,
		[424120] = 8,
		[108396] = 9,
		[14914] = 5,
		[196770] = 6,
		[48265] = 6,
		[294133] = 2,
		[425653] = 12,
		[305392] = 6,
		[426677] = 6,
		[193356] = 4,
		[422517] = "燃燒巨像",
		[196771] = 6,
		[395152] = "Katachi-屠魔山谷",
		[196809] = "神聖影像 <野比伸助>",
		[199852] = 1,
		[370898] = "巨龍波音波音",
		[188370] = 2,
		[120679] = 3,
		[370960] = "巨龍波音波音",
		[407468] = 5,
		[395424] = 4,
		[86392] = 4,
		[108280] = 7,
		[377103] = 6,
		[420540] = "丁卓爾‧睿迅",
		[83381] = "色色發抖 <狩熊>",
		[228532] = 12,
		[370901] = "巨龍波音波音",
		[213405] = 12,
		[205473] = 8,
		[390181] = 12,
		[199844] = 8,
		[395160] = "Katachi-屠魔山谷",
		[269576] = 3,
		[204883] = 5,
		[418533] = "『殘暴者』伊吉拉",
		[105771] = 1,
		[425149] = "薩克利重戰士",
		[374037] = 1,
		[385233] = 1,
		[101568] = 6,
		[335082] = 1,
		[375902] = 5,
		[385234] = 1,
		[853] = 2,
		[190357] = 8,
		[377101] = 6,
		[407244] = "Katachi-屠魔山谷",
		[108271] = 7,
		[429246] = "巨龍波音波音",
		[392388] = 4,
		[108416] = 9,
		[375986] = 7,
		[425153] = 12,
		[390357] = 8,
		[426339] = 6,
		[108281] = 7,
		[212641] = 2,
		[378597] = 7,
		[383706] = 1,
		[186258] = 3,
		[406732] = "Katachi-屠魔山谷",
		[390868] = 5,
		[425154] = 12,
		[383704] = 1,
		[425156] = 1,
		[414660] = 8,
		[197277] = 2,
		[90361] = "色色發抖 <狩熊>",
		[423110] = "『殘暴者』伊吉拉",
		[64844] = 5,
		[20271] = 2,
		[424646] = "焰觸執行者",
		[421064] = "瘤根",
		[396174] = 1,
		[382272] = 8,
		[386621] = 9,
		[387763] = "Katachi-屠魔山谷",
		[121557] = 5,
		[122708] = 6,
		[285452] = 7,
		[320763] = 7,
		[425672] = 12,
		[188592] = 7,
		[334581] = 9,
		[219809] = 6,
		[31850] = 2,
		[199851] = 1,
		[414367] = "『殘暴者』伊吉拉",
		[378081] = 7,
		[342246] = 8,
		[385724] = 2,
		[420251] = "『殘暴者』伊吉拉",
		[386270] = 4,
		[193455] = 3,
		[424140] = "丁卓爾‧睿迅",
		[361195] = "巨龍波音波音",
		[335096] = 1,
		[417488] = 8,
		[232633] = 5,
		[30283] = 9,
		[426648] = 6,
		[10060] = 5,
		[406957] = 2,
		[404184] = 2,
		[409678] = "Katachi-屠魔山谷",
		[417490] = 8,
		[393438] = 7,
		[2580] = "Katachi-屠魔山谷",
		[395296] = "Katachi-屠魔山谷",
		[209388] = 2,
		[199854] = 1,
		[393951] = 1,
		[429262] = 3,
		[417492] = 8,
		[422823] = "斯莫德隆",
		[206930] = 6,
		[428963] = "燃燒巨像",
		[211881] = 12,
		[426703] = "野獸 <狩熊>",
		[320338] = 12,
		[419123] = "菲拉卡",
		[427729] = 7,
		[377066] = 5,
		[391374] = 12,
		[6940] = 2,
		[199600] = 4,
		[256171] = 4,
		[414425] = "『殘暴者』伊吉拉",
		[424616] = 2,
		[394979] = "虛無鞭笞者 <瑪托雅奶奶>",
		[426672] = 6,
		[400097] = 10,
		[389847] = 12,
		[2645] = 7,
		[167105] = 1,
		[424662] = "丁卓爾‧睿迅",
		[343294] = 6,
		[61295] = 7,
		[229976] = 2,
		[414427] = "『殘暴者』伊吉拉",
		[374000] = 6,
		[262232] = 1,
		[207203] = 6,
		[198067] = 7,
		[425176] = 12,
		[223143] = 12,
		[49020] = 6,
		[404195] = "Katachi-屠魔山谷",
		[374002] = 6,
		[199603] = 4,
		[265144] = 5,
		[243241] = 5,
		[41425] = 8,
		[392268] = "Katachi-屠魔山谷",
		[381933] = 7,
		[220890] = 6,
		[407254] = "Katachi-屠魔山谷",
		[416996] = "『殘暴者』伊吉拉",
		[424461] = 7,
		[418527] = 12,
		[425180] = 12,
		[372470] = "巨龍波音波音",
		[185763] = 4,
		[422091] = "瘤根",
		[425181] = 12,
		[426676] = 3,
		[232613] = 1,
		[202164] = 1,
		[253595] = 6,
		[278310] = 8,
		[367364] = "巨龍波音波音",
		[72968] = 1,
		[15290] = 5,
		[19236] = 5,
		[315961] = 1,
		[418531] = "『殘暴者』伊吉拉",
		[32747] = 4,
		[423649] = "丁卓爾‧睿迅",
		[2825] = 7,
		[210155] = 12,
		[390386] = "巨龍波音波音",
		[421603] = "丁卓爾‧睿迅",
		[33110] = 5,
		[406251] = 5,
		[429280] = "斯莫德隆",
		[34433] = 5,
		[52128] = 7,
		[57994] = 7,
		[426284] = 1,
		[421090] = "瘤根",
		[49998] = 6,
		[393971] = 4,
		[421343] = "斯莫德隆",
		[183435] = 2,
		[424165] = 6,
		[371348] = "巨龍波音波音",
		[231390] = 3,
		[425701] = 2,
		[228598] = 8,
		[202168] = 1,
		[390195] = 12,
		[1459] = 8,
		[423720] = "菲拉卡",
		[289577] = 5,
		[417003] = "『殘暴者』伊吉拉",
		[423656] = "丁卓爾‧睿迅",
		[391688] = 1,
		[49039] = 6,
		[343312] = 12,
		[374606] = 6,
		[422523] = "燃燒巨像",
		[387441] = 2,
		[374557] = 6,
		[31884] = 2,
		[368901] = 6,
		[80354] = 6,
		[47568] = 6,
		[384360] = 8,
		[389372] = 9,
		[383328] = 2,
		[23920] = 1,
		[204167] = 6,
		[93825] = "巨龍波音波音",
		[410355] = "Katachi-屠魔山谷",
		[120692] = 5,
		[198589] = 12,
		[387327] = 9,
		[73510] = 5,
		[374349] = "巨龍波音波音",
		[115191] = 4,
		[89753] = "维尼克古里尔 <斯巴達無畏>",
		[375893] = 3,
		[422441] = 6,
		[47788] = 5,
		[54861] = 5,
		[358267] = "巨龍波音波音",
		[385127] = 2,
		[393831] = 12,
	},
	["shield_spellid_cache"] = {
	},
	["latest_encounter_spell_pool_access"] = 1707049193,
	["auto_open_news_window"] = true,
	["got_first_run"] = true,
	["raid_data"] = {
	},
	["merge_pet_abilities"] = false,
	["deathlog_line_height"] = 16,
	["installed_skins_cache"] = {
	},
	["all_switch_config"] = {
		["scale"] = 1,
		["font_size"] = 10,
	},
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_size"] = 12,
		["damage_taken_shadow"] = true,
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["__profiles"] = {
		["福僧-日落沼澤"] = {
			["overall_clear_newtorghast"] = true,
			["use_realtimedps"] = false,
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["show_crowdcontrol_pvm"] = false,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["line_height"] = 16,
				["show_crowdcontrol_pvp"] = true,
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.1921, -- [1]
						0.1921, -- [2]
						0.1921, -- [3]
						0.3869, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[1467] = {
					0.5, -- [1]
					0.625, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1468] = {
					0.625, -- [1]
					0.75, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.125, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					0.875, -- [4]
				},
				[260] = {
					0, -- [1]
					0.125, -- [2]
					0.75, -- [3]
					0.875, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[1473] = {
					0.75, -- [1]
					0.875, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
			},
			["all_in_one_windows"] = {
			},
			["tooltip"] = {
				["tooltip_max_abilities"] = 6,
				["bar_color"] = {
					0.396, -- [1]
					0.396, -- [2]
					0.396, -- [3]
					0.87, -- [4]
				},
				["tooltip_max_pets"] = 2,
				["abbreviation"] = 2,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["background"] = {
					0.0941, -- [1]
					0.0941, -- [2]
					0.0941, -- [3]
					0.8, -- [4]
				},
				["divisor_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["anchor_relative"] = "top",
				["anchored_to"] = 1,
				["show_amount"] = false,
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["commands"] = {
				},
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["fontsize"] = 10,
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["pvp_as_group"] = true,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = false,
			["fade_speed"] = 0.15,
			["death_tooltip_spark"] = false,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["use_self_color"] = false,
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["default_bg_alpha"] = 0.5,
			["trash_concatenate"] = false,
			["deny_score_messages"] = false,
			["profile_save_pos"] = true,
			["standard_skin"] = false,
			["animation_speed"] = 33,
			["animate_scroll"] = false,
			["disable_stretch_from_toolbar"] = false,
			["realtime_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = false,
				["sample_size"] = 3,
				["frame_settings"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["point"] = "TOP",
					["scale"] = 1,
					["width"] = 300,
					["y"] = -110,
					["x"] = 0,
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = true,
					["height"] = 23,
				},
				["update_interval"] = 0.3,
				["text_offset"] = 2,
				["font_face"] = "Friz Quadrata TT",
				["options_frame"] = {
				},
			},
			["memory_ram"] = 64,
			["use_battleground_server_parser"] = false,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["disable_window_groups"] = false,
			["death_tooltip_width"] = 350,
			["force_activity_time_pvp"] = true,
			["instances_suppress_trash"] = 0,
			["clear_ungrouped"] = true,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["overall_clear_pvp"] = true,
			["overall_clear_logout"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["auto_swap_to_dynamic_overall"] = false,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["time_type_original"] = 2,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -329.0004730224609,
							["x"] = 500.0008544921875,
							["w"] = 309.9999389648438,
							["h"] = 157.9999847412109,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["titlebar_shown"] = false,
					["menu_anchor"] = {
						20, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.243,
					["fullborder_size"] = 0.5,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons_2_shadow",
					["micro_displays_locked"] = true,
					["use_auto_align_multi_fontstrings"] = true,
					["rowareaborder_shown"] = false,
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["show_arena_role_icon"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["textL_offset"] = 0,
						["text_yoffset"] = 0,
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\bLEI00D.ttf",
						["faction_icon_size_offset"] = -10,
						["backdrop"] = {
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
						},
						["percent_type"] = 1,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["font_size"] = 16,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["textL_translit_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_hyanda",
						["icon_size_offset"] = 0,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["overlay_color"] = {
							0.7, -- [1]
							0.7, -- [2]
							0.7, -- [3]
							0, -- [4]
						},
						["use_spec_icons"] = true,
						["arena_role_icon_size_offset"] = -10,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_outline"] = false,
						["textR_bracket"] = "(",
						["textR_enable_custom_text"] = false,
						["textL_class_colors"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "Details Hyanda",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["overlay_texture"] = "Details D'ictum",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["show_faction_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["height"] = 21,
					},
					["titlebar_texture"] = "Details Serenity",
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["icon_desaturated"] = false,
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.2352,
					["menu_icons_alpha"] = 0.92,
					["bg_b"] = 0.2588,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.1215, -- [1]
						0.1176, -- [2]
						0.1294, -- [3]
						0.91, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["rowareaborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["switch_healer_in_combat"] = false,
					["skin"] = "Minimalistic",
					["__was_opened"] = true,
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 73,
					["clickthrough_rows"] = false,
					["switch_damager_in_combat"] = false,
					["use_multi_fontstrings"] = true,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["show_sidebars"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 3,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 2,
								["textStyle"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["fontstrings_text_limit_offset"] = -10,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["menu_icons_size"] = 0.82,
					["fullborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["show_timer_arena"] = true,
						["text_face"] = "Accidental Presidency",
						["show_timer_always"] = true,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = {
							1.4, -- [1]
							2, -- [2]
						},
						["enable_custom_text"] = false,
						["show_timer"] = true,
						["show_timer_bg"] = true,
					},
					["rowareaborder_size"] = 0.5,
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["hide_in_combat_alpha"] = 0,
					["micro_displays_side"] = 2,
					["show_statusbar"] = false,
					["libwindow"] = {
						["y"] = 131.9994812011719,
						["x"] = -304.999267578125,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_damager"] = false,
					["bars_grow_direction"] = 1,
					["switch_all_roles_after_wipe"] = false,
					["strata"] = "LOW",
					["fullborder_shown"] = false,
					["grab_on_top"] = false,
					["skin_custom"] = "",
					["switch_tank"] = false,
					["auto_current"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["bg_alpha"] = 0.6,
					["switch_tank_in_combat"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -329.0004730224609,
							["x"] = 500.0008544921875,
							["w"] = 309.9999389648438,
							["h"] = 157.9999847412109,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["bars_sort_direction"] = 1,
					["fontstrings_text3_anchor"] = 38,
					["wallpaper"] = {
						["enabled"] = false,
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["height"] = 114.042518615723,
						["anchor"] = "all",
						["level"] = 2,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["titlebar_height"] = 16,
					["bars_inverted"] = false,
					["menu_icons_color"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
					},
					["titlebar_texture_color"] = {
						0.2, -- [1]
						0.2, -- [2]
						0.2, -- [3]
						0.8, -- [4]
					},
				}, -- [1]
			},
			["report_lines"] = 5,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["show_arena_role_icon"] = false,
			["overall_clear_newboss"] = true,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["total_abbreviation"] = 2,
			["realtimedps_always_arena"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["use_scroll"] = false,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["SHAMAN"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PET"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DRUID"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["MONK"] = {
					0.25, -- [1]
					0.369140625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["UNKNOW"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PRIEST"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["Alliance"] = {
					0.248046875, -- [1]
					0.02968748, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["DEMONHUNTER"] = {
					0.36914063, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["Horde"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["EVOKER"] = {
					0.50390625, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["color_by_arena_team"] = true,
			["disable_alldisplays_window"] = false,
			["default_bg_color"] = 0.0941,
			["broadcaster_enabled"] = false,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["SELF"] = {
					0.89019, -- [1]
					0.32156, -- [2]
					0.89019, -- [3]
				},
				["ARENA_GREEN"] = {
					0.686, -- [1]
					0.372, -- [2]
					0.905, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["version"] = 1,
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["EVOKER"] = {
					0.2, -- [1]
					0.5764, -- [2]
					0.498, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["trash_auto_remove"] = false,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 40,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_flag"] = 16,
			["minimum_combat_time"] = 5,
			["segments_panic_mode"] = false,
			["realtimedps_order_bars"] = false,
			["numerical_system"] = 1,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["segments_amount"] = 40,
			["time_type"] = 2,
			["update_speed"] = 0.2,
			["report_schema"] = 1,
			["numerical_system_symbols"] = "auto",
			["death_tooltip_texture"] = "Details Serenity",
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["instances_no_libwindow"] = false,
			["instances_segments_locked"] = true,
			["deadlog_limit"] = 16,
			["death_log_colors"] = {
				["debuff"] = "purple",
				["buff"] = "silver",
				["friendlyfire"] = "darkorange",
				["heal"] = "green",
				["cooldown"] = "yellow",
				["damage"] = "red",
			},
		},
	},
	["immersion_special_units"] = true,
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Terciob",
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["tooltip"] = "				local actorObject, combatObject, instanceObject = ...\n\n				local iconSize = 20\n				\n				local buffUptimeContainer = actorObject:GetSpellContainer(\"buff\")\n				if (buffUptimeContainer) then\n					for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n						local spellTable = buffUptimeContainer:GetSpell(spellId)\n						if (spellTable) then\n							local used = spellTable.activedamt\n							if (used and used > 0) then\n								local spellName, _, spellIcon = GetSpellInfo(spellId)\n								GameCooltip:AddLine(spellName, used)\n								GameCooltip:AddIcon(spellIcon, 1, 1, iconSize, iconSize)\n								Details:AddTooltipBackgroundStatusbar()\n							end\n						end\n					end\n				end\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				value = math.floor(value)\n				return \"\"\n			",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return math.floor(value) .. \" \"\n			",
			["spellid"] = false,
			["desc"] = "顯示團隊中誰在首領戰時使用了藥水。",
			["name"] = "使用藥水",
			["attribute"] = false,
			["target"] = false,
			["script"] = "				local combatObject, customContainer, instanceObject = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the misc actor container\n				local listOfUtilityActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_MISC)\n				\n				--do the loop:\n				for _, actorObject in ipairs(listOfUtilityActors) do\n					--only player in group\n					if (actorObject:IsGroupPlayer()) then\n						local bFoundPotion = false\n						\n						--get the spell debuff uptime container\n						local debuffUptimeContainer = actorObject:GetSpellContainer(\"debuff\")\n						if (debuffUptimeContainer) then\n							--potion of focus (can't use as pre-potion, so, its amount is always 1\n							local focusPotion = debuffUptimeContainer:GetSpell(DETAILS_FOCUS_POTION_ID)\n							if (focusPotion) then\n								total = total + 1\n								bFoundPotion = true\n								if (top < 1) then\n									top = 1\n								end\n								--add amount to the player\n								customContainer:AddValue(actorObject, 1)\n							end\n						end\n						\n						--get the spell buff uptime container\n						local buffUptimeContainer = actorObject:GetSpellContainer(\"buff\")\n						if (buffUptimeContainer) then\n							for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n								local spellTable = buffUptimeContainer:GetSpell(spellId)\n								if (spellTable) then\n									local used = spellTable.activedamt\n									if (used and used > 0) then\n										total = total + used\n										bFoundPotion = true\n										if (used > top) then\n											top = used\n										end\n										\n										--add amount to the player\n										customContainer:AddValue(actorObject, used)\n									end\n								end\n							end\n						end\n						\n						if (bFoundPotion) then\n							amount = amount + 1\n						end\n					end\n				end\n				\n				--return:\n				return total, top, amount\n				",
			["import_string"] = "1EvBVnkoq4FlxKwDWDjCn6Q0kfD7kL(YwruUMOLK7JaoGPX3rSrgZwLV4F73yJ5LMxjPDfBBzHXZZZmEMhg7p0FHVxoRGhH9x57HkeRzCFVhWcejn)x89YWWROIG8iojt47LYIqPYWFGslW9LHcwM(3cuk83i2MvibCdHMlq0iSm8lYqhhh5e5e9s0pydsS2jjLX4w6hAREnhlk4uzyVEYWbdYfCc9fNeghm2Q3NCgM0RVb2)qd3Vn8MBSvohwYN6P8GCIVxmopY3ZBn7vz4RRzkMid3cXNmKJiXYWICm8BKmmJjim4LXfkKGyynqomnIvqfyUJVNgLpG4UkW2pQljV6Fg2tIyu)Nh(N3(5H367rrBW(EZn8CjqCyRkdNMsIv7vce)fSqD3oCSKnZw9V4ifNIkYfSn3ZOWwkfZBXYstA4Qz9vrvzmI2OYiAJUPV5hfBhmaq3K22qYJalJemUcEds1omLKlMLSuqsjITJvwLR9xBIo6jSq)QPGXwp84IXUt9cgVyX3DVB5Ihd(BxV7TlXnMzGfYLzJKtsuOg03qGQGsTXtYqeEU1bWhs(GBMidlVgmGrt3cffPOTaX1l(foRiRXesIm0QfcJCZFszXC9sSST1KI2SGQltsy13G8yC1Uje9jO0C8(MV)tANP17)a3XRksacvKjiBWVjNFe4lxXsT911cAE0oMGnbpfc1wy1RCH9S33Z6mYb97rZfnHuv7hdCscdQrbFfHO)Qq3IcScEqghBSd2CZzQkxrEtfjrDF6ROTWFhECSmjaniTs)hK41jG6kWVn7(LEbZNTWD2ZbUpyFCC0PJwOC2Kq1LUFtZjZD)(jJNQR9kOe8c85xMMMqRTm8Vay6mjBiBMgSoqqmn(8gnyakoUzpvu1BB6ep763rDB0444)rPU2UvTVoqNCr88WKVl9MxAN5v2xEYUYRPNulJQJb34(vFFCo71k9WsT0PU3fmB(Jph89XUpemE6utVH3okQNPBuJZc0Q0YpvEYwrdNS7yTDJRV4IBd5kNr4lTzPdSBq(bogTr0D3PPJzGdA9ShFf(a6fZStPvOD7f7PRu(4eX4x1QdxDOTRcZ1fwDs05891)SLTUszmvoXU7EVtjJtA07rBSujQvz2zlnAnRz1Th(BHVHb6)t5tGPdlh3EuZC3hCCw942ibCkJvfc9rFemwQGKvpf9Bt87mt9XMGUEK33POENfX)5iA)HksFPIYVtr4par32H)ZWHW6xE8IYqmYixwf5U0e2f8jQNqQ0NUut1KpfYIwTbQJD474gfRSQ5NAEhZpMdY7yQUDsb8cwJjVSwC632boywTc)fLo4ou0)Po2engoDQOiFfcoy07rCPQ12x47))d",
			["script_version"] = 8,
		}, -- [1]
		{
			["source"] = false,
			["total_script"] = false,
			["author"] = "Terciob",
			["percent_script"] = false,
			["desc"] = " 顯示團隊中誰使用了治療藥水或治療石。",
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["spellid"] = false,
			["name"] = "治療藥水&治療石",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, top, amount = 0, 0, 0\n				\n				local listOfHealingActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_HEAL)\n				for _, actorObject in ipairs(listOfHealingActors) do\n					local listOfSpells = actorObject:GetSpellList()\n					local found = false\n					\n					for spellId, spellTable in pairs(listOfSpells) do\n						if (LIB_OPEN_RAID_HEALING_POTIONS[spellId]) then\n							instanceContainer:AddValue(actorObject, spellTable.total)\n							total = total + spellTable.total\n							if (top < spellTable.total) then\n								top = spellTable.total\n							end\n							found = true\n						end\n					end\n					\n					if (found) then\n						amount = amount + 1\n					end\n				end\n				\n				return total, top, amount\n			",
			["target"] = false,
			["tooltip"] = "				local actorObject, combatObject, instanceObject = ...\n				local spellContainer = actorObject:GetSpellContainer(\"spell\")\n				\n				local iconSize = 20\n				\n				local allHealingPotions = {6262}\n				for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n					allHealingPotions[#allHealingPotions+1] = spellId\n				end\n				\n				for i = 1, #allHealingPotions do\n					local spellId = allHealingPotions[i]\n					local spellTable = spellContainer:GetSpell(spellId)\n					if (spellTable) then\n						local spellName, _, spellIcon = GetSpellInfo(spellId)\n						GameCooltip:AddLine(spellName, Details:ToK(spellTable.total))\n						GameCooltip:AddIcon(spellIcon, 1, 1, iconSize, iconSize)\n						GameCooltip:AddStatusBar (100, 1, 0, 0, 0, 0.75)\n					end\n				end\n			",
			["attribute"] = false,
			["script_version"] = 18,
		}, -- [2]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format(\"%.1f\", value/top*100)\n			",
			["desc"] = "報告每個角色花了多少時間在輸出傷害。",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["spellid"] = false,
			["name"] = "傷害活躍時間",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, amount = 0, 0\n\n				--get the damager actors\n				local listOfDamageActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_DAMAGE)\n\n				for _, actorObject in ipairs(listOfDamageActors) do\n					if (actorObject:IsGroupPlayer()) then\n						local activity = actorObject:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player\n						instanceContainer:AddValue(actorObject, activity)\n					end\n				end\n\n				--return:\n				return total, combatObject:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor(value/60), math.floor(value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [3]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format(\"%.1f\", value/top*100)\n			",
			["desc"] = "報告每個角色花了多少時間在補血。",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["spellid"] = false,
			["name"] = "治療活躍時間",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, amount = 0, 0\n\n				--get the healing actors\n				local listOfHealingActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_HEAL)\n\n				for _, actorObject in ipairs(listOfHealingActors) do\n					if (actorObject:IsGroupPlayer()) then\n						local activity = actorObject:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player\n						instanceContainer:AddValue (actorObject, activity)\n					end\n				end\n\n				--return:\n				return total, combatObject:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor(value/60), math.floor(value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the crowd control amount for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor(value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["spellid"] = false,
			["name"] = "施放控場",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs(actor.cc_done_spells._ActorTable) do\n				    tinsert(spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs(spells) do\n				    local name, _, icon = GetSpellInfo(spell [1])\n				    GameCooltip:AddLine(name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs(actor.cc_done_targets) do\n				    tinsert(targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass(actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs(targets) do\n				    GameCooltip:AddLine(target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n\n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass(target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon(class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs(misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor(character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of crowd control received for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor(value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["spellid"] = false,
			["name"] = "受到控場",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs(misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert(from, {character:name(), on_actor})\n\n					    for spellid, spell in pairs(character.cc_done_spells._ActorTable) do\n\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs(spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert(spells, {spellid, spell_on_actor})\n						    end\n						end\n\n					    end\n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs(spells) do\n				    local name, _, icon = GetSpellInfo(spell [1])\n				    GameCooltip:AddLine(name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs(from) do\n				    GameCooltip:AddLine(t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n\n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass(t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon(class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n\n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs(misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n\n					for player_name, amount in pairs(character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n\n				    end\n				end\n\n				return total, top, amt\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor(value) / combat:GetCombatTime())\n				local percent = string.format(\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在視窗中顯示你的法術。",
			["tooltip"] = "			--config:\n			--Background RBG and Alpha:\n			local R, G, B, A = 0, 0, 0, 0.75\n			local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n\n			--get the parameters passed\n			local spell, combat, instance = ...\n\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GC = GameCooltip\n			GC:SetOption(\"YSpacingMod\", 0)\n\n			local role = DetailsFramework.UnitGroupRolesAssigned(\"player\")\n\n			if (spell.n_total) then\n\n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = Details.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n\n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n\n			    local debuff_uptime_total, cast_string = \"\", \"\"\n			    local misc_actor = instance.showing (4, Details.playername)\n			    if (misc_actor) then\n				local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n				if (debuff_uptime) then\n				    debuff_uptime_total = floor(debuff_uptime / instance.showing:GetCombatTime() * 100)\n				end\n\n				local spellName = GetSpellInfo(spell.id)\n				local amountOfCasts = combat:GetSpellCastAmount(Details.playername, spellName)\n\n				if (amountOfCasts == 0) then\n				    amountOfCasts = \"(|cFFFFFF00?|r)\"\n				end\n				cast_string = cast_string .. amountOfCasts\n			    end\n\n			    --Cooltip code\n			    GC:AddLine(\"Casts:\", cast_string or \"?\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (debuff_uptime_total ~= \"\") then\n				GC:AddLine(\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n				GC:AddStatusBar (100, 1, R, G, B, A)\n			    end\n\n			    GC:AddLine(\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local average = spell.total / total_hits\n			    GC:AddLine(\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Normal Hits: \", spell.n_amt .. \" (\" ..floor( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local n_average = spell.n_total / spell.n_amt\n			    local T = (combat_time*spell.n_total)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n\n			    GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format(\"%.1f\",spell.n_total / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Critical Hits: \", spell.c_amt .. \" (\" ..floor( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_total/spell.c_amt\n				local T = (combat_time*spell.c_total)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_total / T\n\n				GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine(\"Average / E-Dps: \",  \"0 / 0\")\n			    end\n\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n\n			elseif (spell.n_total) then\n\n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n\n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n\n			    --Cooltip code\n			    GC:AddLine(\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local average = spell.total / total_hits\n			    GC:AddLine(\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Normal Hits: \", spell.n_amt .. \" (\" ..floor( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local n_average = spell.n_total / spell.n_amt\n			    local T = (combat_time*spell.n_total)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n\n			    GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format(\"%.1f\",spell.n_total / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Critical Hits: \", spell.c_amt .. \" (\" ..floor( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_total/spell.c_amt\n				local T = (combat_time*spell.c_total)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_total / T\n\n				GC:AddLine(\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine(\"Average / E-Hps: \",  \"0 / 0\")\n			    end\n\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			end\n			",
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["name"] = "我的法術",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n\n				local role = DetailsFramework.UnitGroupRolesAssigned(\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then\n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs(spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n\n					for _, PetName in ipairs(player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs(pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 10,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "顯示對被標記骷髏的目標所輸出的傷害。",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine(RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["name"] = "對骷髏標記目標的傷害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--raid target flags:\n				-- 128: skull\n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n\n				--do the loop\n				for _, actor in ipairs(Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "顯示對其他任何被標記的目標所輸出的傷害。",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine(RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine(RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine(RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine(RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine(RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine(RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine(RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["name"] = "對其他標記目標的傷害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs(Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat(-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat(0)\n\n				local AllSpells = {}\n\n				local playerTotal = 0\n\n				--overall\n				local player = OverallCombat [1]:GetActor(actor.nome)\n				if (player) then\n					playerTotal = playerTotal + player.total\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs(playerSpells) do\n						AllSpells [spellID] = spellTable.total\n					end\n				end\n				--current\n				if (Details.in_combat) then\n					local player = CurrentCombat [1]:GetActor(actor.nome)\n					if (player) then\n						playerTotal = playerTotal + player.total\n						local playerSpells = player:GetSpellList()\n						for spellID, spellTable in pairs(playerSpells) do\n							AllSpells [spellID] = (AllSpells [spellID] or 0) + (spellTable.total or 0)\n						end\n					end\n				end\n\n				local sortedList = {}\n				for spellID, total in pairs(AllSpells) do\n					tinsert(sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--build the tooltip\n\n				local topSpellTotal = sortedList and sortedList[1] and sortedList[1][2] or 0\n\n				for i, t in ipairs(sortedList) do\n					local spellID, total = unpack(t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfo(spellID)\n\n						local spellPercent = total / playerTotal * 100\n						local formatedSpellPercent = format(\"%.1f\", spellPercent)\n\n						if (string.len(formatedSpellPercent) < 4) then\n							formatedSpellPercent = formatedSpellPercent  .. \"0\"\n						end\n\n						GameCooltip:AddLine(spellName, format_func (_, total) .. \"    \" .. formatedSpellPercent  .. \"%\")\n\n						Details:AddTooltipBackgroundStatusbar(false, total / topSpellTotal * 100)\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, 0.078125, 0.921875, 0.078125, 0.921875)\n\n					end\n				end\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat(-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat(0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--calculate the DPS and return it as percent\n				local totalValue = value\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n\n				return s\n			",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return value\n			",
			["spellid"] = false,
			["displayName"] = "輸出傷害",
			["name"] = "動態整場傷害",
			["desc"] = "Show overall damage done on the fly.",
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat(-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat(0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs( damage_container_overall ) do\n					--only player in group\n					if (player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n\n				if (Details.in_combat) then\n					for _, player in ipairs( damage_container_current ) do\n						--only player in group\n						if (player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)\n						end\n					end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 8,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs(actor.pets) do\n				    local pet = Combat :GetActor(1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine(actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs(actor.pets) do\n				    local pet = Combat :GetActor(1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n\n					GameCooltip:AddLine(petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()\n\n				    end\n				end\n			",
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["name"] = "對護盾的傷害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs(Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs(actor.pets) do\n					    local pet = Combat :GetActor(1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)\n\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 1,
		}, -- [11]
		{
			["source"] = false,
			["author"] = "Bass",
			["desc"] = "顯示承受了多少可避免的傷害。",
			["total_script"] = "        local value, top, total, Combat, Instance, Actor = ...\n\n        if _G.Details_Elitism then\n            return _G.Details_Elitism:GetSpellDisplayText(Combat:GetCombatNumber(), Actor.my_actor.serial)\n        end\n        return \"\"\n    ",
			["icon"] = 136105,
			["spellid"] = false,
			["name"] = "可避免的傷害",
			["tooltip"] = "        local Actor, Combat, Instance = ...\n        local GameCooltip = GameCooltip\n\n        if _G.Details_Elitism then\n            local realCombat\n            for i = -1, 25 do\n                local current = Details:GetCombat(i)\n                if current and current:GetCombatNumber() == Combat.combat_counter then\n                    realCombat = current\n                    break\n                end\n            end\n\n            if not realCombat then return end\n\n            local sortedList = {}\n            local playerGuid = realCombat[1]:GetActor(Actor.nome):guid()\n            _, _, spells = _G.Details_Elitism:GetRecord(Combat:GetCombatNumber(), playerGuid)\n            for spellID, spelldata in pairs(spells) do\n                tinsert(sortedList, {spellID, spelldata.sum, spelldata.cnt})\n            end\n            sort(sortedList, Details.Sort2)\n\n            local format_func = Details:GetCurrentToKFunction()\n            for _, tbl in ipairs(sortedList) do\n                local spellID, amount, cnt = unpack(tbl)\n                local spellName, _, spellIcon = Details.GetSpellInfo(spellID)\n\n                local tooltipText = _G.Details_Elitism:GetSpellTooltipText(Combat:GetCombatNumber(), playerGuid, spellID)\n                GameCooltip:AddLine(spellName, tooltipText)\n                Details:AddTooltipBackgroundStatusbar()\n                GameCooltip:AddIcon(spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n            end\n        end\n    ",
			["target"] = false,
			["script"] = "        local Combat, CustomContainer, Instance = ...\n        local total, top, amount = 0, 0, 0\n\n        if _G.Details_Elitism then\n            local Container = Combat:GetActorList(DETAILS_ATTRIBUTE_MISC)\n            for _, player in ipairs(Container) do\n                if player:IsGroupPlayer() then\n                    -- we only record the players in party\n                    local damage, cnt = _G.Details_Elitism:GetRecord(Combat:GetCombatNumber(), player:guid())\n                    if damage > 0 or cnt > 0 then\n                        CustomContainer:AddValue(player, damage)\n                    end\n                end\n            end\n\n            total, top = CustomContainer:GetTotalAndHighestValue()\n            amount = CustomContainer:GetNumActors()\n        end\n\n        return total, top, amount\n    ",
			["attribute"] = false,
			["script_version"] = 5,
		}, -- [12]
		{
			["source"] = false,
			["author"] = "Bass",
			["desc"] = "顯示被擊中了多少可避免的法術。",
			["total_script"] = "        local value, top, total, Combat, Instance, Actor = ...\n\n        if _G.Details_Elitism then\n            return _G.Details_Elitism:GetAuraDisplayText(Combat:GetCombatNumber(), Actor.my_actor.serial)\n        end\n        return \"\"\n    ",
			["icon"] = 1778229,
			["spellid"] = false,
			["name"] = "可避免的法術",
			["tooltip"] = "        local Actor, Combat, Instance = ...\n        local GameCooltip = GameCooltip\n\n        if _G.Details_Elitism then\n            local realCombat\n            for i = -1, 25 do\n                local current = Details:GetCombat(i)\n                if current and current:GetCombatNumber() == Combat.combat_counter then\n                    realCombat = current\n                    break\n                end\n            end\n\n            if not realCombat then return end\n\n            local sortedList = {}\n            _, spells = _G.Details_Elitism:GetAuraRecord(Combat:GetCombatNumber(), realCombat[1]:GetActor(Actor.nome):guid())\n            for spellID, spelldata in pairs(spells) do\n                tinsert(sortedList, {spellID, spelldata.cnt})\n            end\n            sort(sortedList, Details.Sort2)\n\n            local format_func = Details:GetCurrentToKFunction()\n            for _, tbl in ipairs(sortedList) do\n                local spellID, cnt = unpack(tbl)\n                local spellName, _, spellIcon = Details.GetSpellInfo(spellID)\n\n                GameCooltip:AddLine(spellName, format_func(_, cnt))\n                Details:AddTooltipBackgroundStatusbar()\n                GameCooltip:AddIcon(spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n            end\n        end\n    ",
			["target"] = false,
			["script"] = "        local Combat, CustomContainer, Instance = ...\n        local total, top, amount = 0, 0, 0\n\n        if _G.Details_Elitism then\n            local Container = Combat:GetActorList(DETAILS_ATTRIBUTE_MISC)\n            for _, player in ipairs(Container) do\n                if player:IsGroupPlayer() then\n                    -- we only record the players in party\n                    local cnt, _ = _G.Details_Elitism:GetAuraRecord(Combat:GetCombatNumber(), player:guid())\n                    -- _G.Details_Elitism:Debug(\"guid %s target %s hit %s\", player:guid() or 0, target or 0,hit or 0)\n                    if cnt > 0 then\n                        CustomContainer:AddValue(player, cnt)\n                    end\n                end\n            end\n\n            total, top = CustomContainer:GetTotalAndHighestValue()\n            amount = CustomContainer:GetNumActors()\n        end\n\n        return total, top, amount\n    ",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [13]
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
			["420236"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"420236", -- [2]
				"殞落之星（1）", -- [3]
				6.1, -- [4]
				236168, -- [5]
				["id"] = 2786,
			},
			["424581"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"424581", -- [2]
				"驅散（1）", -- [3]
				26, -- [4]
				429590, -- [5]
				["id"] = 2786,
			},
			["422032"] = {
				"Fyrakk the Blazing", -- [1]
				"422032", -- [2]
				"靈魂（1）", -- [3]
				19.9, -- [4]
				132279, -- [5]
				["id"] = 2677,
			},
			["428400"] = {
				"Fyrakk the Blazing", -- [1]
				"428400", -- [2]
				"爆炸核心", -- [3]
				68.3, -- [4]
				1371268, -- [5]
				["id"] = 2677,
			},
			["nil"] = {
				"Wipe", -- [1]
				"nil", -- [2]
				"重生", -- [3]
				30, -- [4]
				236372, -- [5]
				["id"] = 2820,
			},
			["stages"] = {
				"Gnarlroot", -- [1]
				"stages", -- [2]
				"階段2（1）", -- [3]
				91, -- [4]
				136246, -- [5]
				["id"] = 2820,
			},
			["422691"] = {
				"Smolderon", -- [1]
				"422691", -- [2]
				"岩漿（1）", -- [3]
				27, -- [4]
				451169, -- [5]
				["id"] = 2824,
			},
			["421636"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"421636", -- [2]
				"推開", -- [3]
				3.5, -- [4]
				1029585, -- [5]
				["id"] = 2786,
			},
			["424140"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"424140", -- [2]
				"超級新星（1）", -- [3]
				39.4, -- [4]
				2175503, -- [5]
				["id"] = 2786,
			},
			["422935"] = {
				"Fyrakk the Blazing", -- [1]
				"422935", -- [2]
				"永恆火颶（1）", -- [3]
				18, -- [4]
				460698, -- [5]
				["id"] = 2677,
			},
			["417807"] = {
				"Fyrakk the Blazing", -- [1]
				"417807", -- [2]
				"著火（1）", -- [3]
				8, -- [4]
				463567, -- [5]
				["id"] = 2677,
			},
			["422776"] = {
				"Igira the Cruel", -- [1]
				"422776", -- [2]
				"折磨（1）", -- [3]
				46, -- [4]
				236226, -- [5]
				["id"] = 2709,
			},
			["422577"] = {
				"Smolderon", -- [1]
				"422577", -- [2]
				"炸彈：一熊小花一", -- [3]
				6, -- [4]
				525026, -- [5]
				["id"] = 2824,
			},
			["417431"] = {
				"Fyrakk the Blazing", -- [1]
				"417431", -- [2]
				"正面衝擊波（1）", -- [3]
				9, -- [4]
				5205711, -- [5]
				["id"] = 2677,
			},
			["423265"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"423265", -- [2]
				"種子（1）", -- [3]
				60, -- [4]
				460698, -- [5]
				["id"] = 2786,
			},
			["424456"] = {
				"Igira the Cruel", -- [1]
				"424456", -- [2]
				"跳躍（1）", -- [3]
				19, -- [4]
				645226, -- [5]
				["id"] = 2709,
			},
			["422026"] = {
				"Gnarlroot", -- [1]
				"422026", -- [2]
				"尖嘯（1）", -- [3]
				3.3, -- [4]
				4050664, -- [5]
				["id"] = 2820,
			},
			["417455"] = {
				"Fyrakk the Blazing", -- [1]
				"417455", -- [2]
				"夢境撕裂（1）", -- [3]
				42, -- [4]
				1357803, -- [5]
				["id"] = 2677,
			},
			["416996"] = {
				"Igira the Cruel", -- [1]
				"416996", -- [2]
				"旋刃（1）", -- [3]
				4.9, -- [4]
				4624383, -- [5]
				["id"] = 2709,
			},
			["421937"] = {
				"Fyrakk the Blazing", -- [1]
				"421937", -- [2]
				"寶珠（1）", -- [3]
				3.5, -- [4]
				4914679, -- [5]
				["id"] = 2677,
			},
			["422518"] = {
				"Fyrakk the Blazing", -- [1]
				"422518", -- [2]
				"強效火颶（1）", -- [3]
				35.5, -- [4]
				1035051, -- [5]
				["id"] = 2677,
			},
			["421969"] = {
				"Smolderon", -- [1]
				"421969", -- [2]
				"旋風", -- [3]
				10, -- [4]
				4914680, -- [5]
				["id"] = 2824,
			},
			["419123"] = {
				"Fyrakk the Blazing", -- [1]
				"419123", -- [2]
				"墮落獄火（1）", -- [3]
				5.5, -- [4]
				237588, -- [5]
				["id"] = 2677,
			},
			["414186"] = {
				"Fyrakk the Blazing", -- [1]
				"414186", -- [2]
				"燃焰（1）", -- [3]
				32, -- [4]
				4914673, -- [5]
				["id"] = 2677,
			},
			["422524"] = {
				"Fyrakk the Blazing", -- [1]
				"422524", -- [2]
				"吐息（1）", -- [3]
				58.5, -- [4]
				5342925, -- [5]
				["id"] = 2677,
			},
			["423260"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"423260", -- [2]
				"蘑菇（1）", -- [3]
				22, -- [4]
				571319, -- [5]
				["id"] = 2786,
			},
			["423601"] = {
				"Fyrakk the Blazing", -- [1]
				"423601", -- [2]
				"埃達希爾之種", -- [3]
				6.5, -- [4]
				4554354, -- [5]
				["id"] = 2677,
			},
			["421455"] = {
				"Smolderon", -- [1]
				"421455", -- [2]
				"過熱（1）", -- [3]
				10.5, -- [4]
				460698, -- [5]
				["id"] = 2824,
			},
			["419506"] = {
				"Fyrakk the Blazing", -- [1]
				"419506", -- [2]
				"火颶（1）", -- [3]
				13, -- [4]
				136186, -- [5]
				["id"] = 2677,
			},
			["410223"] = {
				"Fyrakk the Blazing", -- [1]
				"410223", -- [2]
				"吐息（1）", -- [3]
				10, -- [4]
				4914672, -- [5]
				["id"] = 2677,
			},
			["422837"] = {
				"Fyrakk the Blazing", -- [1]
				"422837", -- [2]
				"咆哮（1）", -- [3]
				34, -- [4]
				134158, -- [5]
				["id"] = 2677,
			},
			["421840"] = {
				"Gnarlroot", -- [1]
				"421840", -- [2]
				"虛弱（1）", -- [3]
				20, -- [4]
				4914675, -- [5]
				["id"] = 2820,
			},
			["419144"] = {
				"Fyrakk the Blazing", -- [1]
				"419144", -- [2]
				"腐化", -- [3]
				13, -- [4]
				532284, -- [5]
				["id"] = 2677,
			},
			["420422"] = {
				"Fyrakk the Blazing", -- [1]
				"420422", -- [2]
				"野火（1）", -- [3]
				4, -- [4]
				135823, -- [5]
				["id"] = 2677,
			},
			["421343"] = {
				"Smolderon", -- [1]
				"421343", -- [2]
				"坦克分攤（1）", -- [3]
				13, -- [4]
				510053, -- [5]
				["id"] = 2824,
			},
			["424495"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"424495", -- [2]
				"藤蔓（1）", -- [3]
				10.1, -- [4]
				5351059, -- [5]
				["id"] = 2786,
			},
			["421898"] = {
				"Gnarlroot", -- [1]
				"421898", -- [2]
				"增援（1）", -- [3]
				15, -- [4]
				463567, -- [5]
				["id"] = 2820,
			},
			["414888"] = {
				"Igira the Cruel", -- [1]
				"414888", -- [2]
				"長矛（1）", -- [3]
				11, -- [4]
				4914678, -- [5]
				["id"] = 2709,
			},
			["421398"] = {
				"Tindral Sageswift, Seer of the Flame", -- [1]
				"421398", -- [2]
				"火焰光束（1）", -- [3]
				34, -- [4]
				236216, -- [5]
				["id"] = 2786,
			},
			["412761"] = {
				"Fyrakk the Blazing", -- [1]
				"412761", -- [2]
				"擊飛", -- [3]
				9.2, -- [4]
				5319139, -- [5]
				["id"] = 2677,
			},
			["422039"] = {
				"Gnarlroot", -- [1]
				"422039", -- [2]
				"正面技能（1）", -- [3]
				20, -- [4]
				4914673, -- [5]
				["id"] = 2820,
			},
			["421972"] = {
				"Gnarlroot", -- [1]
				"421972", -- [2]
				"炸彈（1）", -- [3]
				32, -- [4]
				429590, -- [5]
				["id"] = 2820,
			},
		},
		["latest_boss_mods_access"] = 1707054132,
		["encounter_timers_dbm"] = {
		},
	},
	["check_stuttering"] = false,
	["spell_category_savedtable"] = {
	},
	["played_class_time"] = true,
	["report_where"] = "SAY",
	["class_time_played"] = {
		[9] = {
			["DEATHKNIGHT"] = 5324.43200000003,
		},
	},
	["latest_spell_pool_access"] = 1707049193,
	["slash_me_used"] = false,
	["details_auras"] = {
	},
	["run_code"] = {
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["show_warning_id1"] = true,
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 10,
		["mythicrun_time_type"] = 1,
		["reverse_death_log"] = false,
		["make_overall_when_done"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["latest_npcid_pool_access"] = 1707049193,
	["exit_errors"] = {
	},
	["parser_options"] = {
		["energy_overflow"] = false,
		["shield_overheal"] = false,
	},
	["spellid_ignored"] = {
	},
	["createauraframe"] = {
	},
	["data_wipes_exp"] = {
		["9"] = false,
		["14"] = false,
		["13"] = false,
		["12"] = false,
		["11"] = false,
		["10"] = true,
	},
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 2,
		["logons"] = 2,
		["version_announce"] = 0,
		["MIN_COMBAT_TIME"] = true,
		["ctrl_click_close_tutorial"] = false,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["bookmark_tutorial"] = false,
	},
	["switchSaved"] = {
		["slots"] = 24,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
		},
	},
	["show_totalhitdamage_on_overkill"] = false,
	["aura_tracker_frame"] = {
		["scaletable"] = {
			["scale"] = 1,
		},
		["position"] = {
		},
	},
	["spell_category_latest_save"] = 0,
	["realm_sync"] = true,
	["item_level_pool"] = {
		["Player-980-06C84FBA"] = {
			["name"] = "一熊小花一",
			["time"] = 1707053534,
			["ilvl"] = 488.625,
		},
		["Player-980-0684500C"] = {
			["time"] = 1707054526,
			["name"] = "野比伸助",
			["ilvl"] = 485.75,
		},
		["Player-980-06D035A4"] = {
			["time"] = 1707054507,
			["name"] = "你怎麼出來了",
			["ilvl"] = 483.125,
		},
		["Player-980-06C81E49"] = {
			["time"] = 1707054526,
			["name"] = "二熊小花二",
			["ilvl"] = 482.6875,
		},
		["Player-980-06D3A8E0"] = {
			["time"] = 1707054526,
			["name"] = "熊熊戰著打",
			["ilvl"] = 453,
		},
		["Player-980-06C781DC"] = {
			["time"] = 1707054527,
			["name"] = "矮熊-屠魔山谷",
			["ilvl"] = 484.1875,
		},
		["Player-980-06CF62E5"] = {
			["time"] = 1707054483,
			["name"] = "寶寶牧",
			["ilvl"] = 480.4375,
		},
		["Player-980-06DD4EB5"] = {
			["time"] = 1707054527,
			["name"] = "巨龍波音波音",
			["ilvl"] = 486.75,
		},
		["Player-980-06EF29DB"] = {
			["time"] = 1707054526,
			["name"] = "無所畏惧",
			["ilvl"] = 464.6875,
		},
		["Player-980-06C85DF5"] = {
			["time"] = 1707054526,
			["name"] = "逆特",
			["ilvl"] = 485.8125,
		},
		["Player-980-06C7DEF9"] = {
			["name"] = "乂熊小花乂",
			["time"] = 1707053784,
			["ilvl"] = 477.5625,
		},
		["Player-980-0790228B"] = {
			["time"] = 1707054526,
			["name"] = "莉莉濕",
			["ilvl"] = 485.1875,
		},
		["Player-980-06C84865"] = {
			["name"] = "路邊有小草",
			["time"] = 1707050454,
			["ilvl"] = 484.8125,
		},
		["Player-980-06D71F13"] = {
			["time"] = 1707054526,
			["name"] = "福僧",
			["ilvl"] = 485.5625,
		},
		["Player-963-06CDA42D"] = {
			["time"] = 1707054497,
			["name"] = "天兵牧師-眾星之子",
			["ilvl"] = 481,
		},
		["Player-980-06C824AA"] = {
			["name"] = "狩熊",
			["time"] = 1707053526,
			["ilvl"] = 487.5,
		},
		["Player-980-06CC4B5F"] = {
			["time"] = 1707054526,
			["name"] = "蒜頭叔",
			["ilvl"] = 486.375,
		},
		["Player-980-079BE587"] = {
			["name"] = "天兵法師",
			["time"] = 1707053570,
			["ilvl"] = 487.3125,
		},
		["Player-980-077CDA3C"] = {
			["time"] = 1707054528,
			["name"] = "Solu",
			["ilvl"] = 482.625,
		},
		["Player-980-06FFB3D3"] = {
			["time"] = 1707054512,
			["name"] = "食肉騎士",
			["ilvl"] = 475.9375,
		},
		["Player-980-076FD4B9"] = {
			["name"] = "Nayer",
			["time"] = 1707050522,
			["ilvl"] = 487.3125,
		},
		["Player-980-06ECCF75"] = {
			["name"] = "斯巴達無畏",
			["time"] = 1707053596,
			["ilvl"] = 485.75,
		},
		["Player-980-06C9F529"] = {
			["name"] = "你這樣太快了",
			["time"] = 1707053628,
			["ilvl"] = 484.625,
		},
		["Player-980-06D3C8D0"] = {
			["name"] = "寶寶戰",
			["time"] = 1707053584,
			["ilvl"] = 487.125,
		},
		["Player-980-06D31412"] = {
			["name"] = "迪克杭特",
			["time"] = 1707053534,
			["ilvl"] = 485.8125,
		},
		["Player-980-0701E72C"] = {
			["name"] = "Riemelt",
			["time"] = 1707053578,
			["ilvl"] = 482.5,
		},
		["Player-980-06C7CBD2"] = {
			["time"] = 1707054513,
			["name"] = "壯熊爸爸",
			["ilvl"] = 483.4375,
		},
		["Player-980-06DB72AC"] = {
			["time"] = 1707054526,
			["name"] = "Katachi-屠魔山谷",
			["ilvl"] = 484.375,
		},
		["Player-980-06C7F734"] = {
			["time"] = 1707054526,
			["name"] = "被自己帥醒來",
			["ilvl"] = 478.0625,
		},
	},
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["merge_player_abilities"] = false,
	["spell_category_latest_query"] = 0,
	["savedTimeCaptures"] = {
	},
	["latest_news_saw"] = "10.2.5 12237",
	["damage_scroll_position"] = {
		["scale"] = 1,
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Breakdown Window.", -- [1]
		"2 - Clearing user placed position from instance windows.", -- [2]
		"  - 1 has baseFrame: yes.", -- [3]
		"4 - Reversing switches.", -- [4]
		"6 - Saving Config.", -- [5]
		"7 - Saving Profiles.", -- [6]
		"8 - Saving nicktag cache.", -- [7]
		"9 - Saving Auto Run Code.", -- [8]
	},
	["encounter_journal_cache"] = {
	},
	["update_warning_timeout"] = 10,
	["deathlog_healingdone_min"] = 1,
}
__details_backup = {
	["_exit_error"] = {
	},
	["_instance_backup"] = {
	},
	["_general_logs"] = {
	},
}
__details_debug = {
}
