
PawnOptions = {
	["LastVersion"] = 2.0807,
	["LastPlayerFullName"] = "我會飛那你呢-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 153923,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153923::::::::60:256::86:1:1602::::::|h[共治兜帽]|h|r",
		}, -- [1]
		{
			["ID"] = 153925,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153925::::::::60:256::86:1:1602::::::|h[共治項鍊]|h|r",
		}, -- [2]
		{
			["ID"] = 153931,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153931::::::::60:256::86:1:1602::::::|h[共治肩墊]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 153929,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153929::::::::60:256::86:1:1602::::::|h[共治法衣]|h|r",
		}, -- [5]
		{
			["ID"] = 153932,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153932::::::::60:256::86:1:1602::::::|h[共治之索]|h|r",
		}, -- [6]
		{
			["ID"] = 153924,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153924::::::::60:256::86:1:1602::::::|h[共治護腿]|h|r",
		}, -- [7]
		{
			["ID"] = 153921,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153921::::::::60:256::86:1:1602::::::|h[共治便鞋]|h|r",
		}, -- [8]
		{
			["ID"] = 153933,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153933::::::::60:256::86:1:1602::::::|h[共治裹腕]|h|r",
		}, -- [9]
		{
			["ID"] = 153922,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153922::::::::60:256::86:1:1602::::::|h[共治裹手]|h|r",
		}, -- [10]
		{
			["ID"] = 153928,
			["Level"] = 180,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:153928::::::::60:256::86:1:1602::::::|h[共治智慧之戒]|h|r",
		}, -- [11]
		{
			["ID"] = 153927,
			["Level"] = 180,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:153927::::::::60:256::86:1:1602::::::|h[共治智慧指環]|h|r",
		}, -- [12]
		{
			["ID"] = 153926,
			["Level"] = 180,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:153926::::::::60:256::86:1:1602::::::|h[共治智慧塑像]|h|r",
		}, -- [13]
		{
			["ID"] = 153930,
			["Level"] = 180,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:153930::::::::60:256::86:1:1602::::::|h[共治智慧之石]|h|r",
		}, -- [14]
		{
			["ID"] = 153920,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153920::::::::60:256::86:1:1602::::::|h[共治智慧披風]|h|r",
		}, -- [15]
		{
			["ID"] = 153934,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153934::::::::60:256::86:1:1602::::::|h[共治法杖]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "PRIEST",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
