
PawnOptions = {
	["LastVersion"] = 2.053,
	["LastPlayerFullName"] = "一輪-台灣傳奇地城",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 186292,
			["Level"] = 252,
			["Link"] = "|cffa335ee|Hitem:186292::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[攀纏惡意軟帽]|h|r",
		}, -- [1]
		{
			["ID"] = 186379,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186379::::::::60:270::57:4:6652:7574:1498:6646:1:28:483:::::|h[界間鑰石]|h|r",
		}, -- [2]
		{
			["ID"] = 186336,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186336::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[陰險知己肩甲]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 186334,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186334::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[枯心飾釘胸甲]|h|r",
		}, -- [5]
		{
			["ID"] = 186332,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186332::::::::60:270::57:4:6652:7574:1498:6646:1:28:483:::::|h[風行者的佩帶]|h|r",
		}, -- [6]
		{
			["ID"] = 186331,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186331::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[精英亞拉納克馬褲]|h|r",
		}, -- [7]
		{
			["ID"] = 186363,
			["Level"] = 252,
			["Link"] = "|cffa335ee|Hitem:186363::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[不穩定的充能長靴]|h|r",
		}, -- [8]
		nil, -- [9]
		{
			["ID"] = 186295,
			["Level"] = 252,
			["Link"] = "|cffa335ee|Hitem:186295::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[忠誠科瓦迪爾的裹手]|h|r",
		}, -- [10]
		{
			["ID"] = 186377,
			["Level"] = 259,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cffa335ee|Hitem:186377::::::::60:270::57:4:6652:7574:1498:6646:1:28:483:::::|h[奎爾薩拉斯黯淡徽記]|h|r",
		}, -- [11]
		{
			["ID"] = 178781,
			["Level"] = 252,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cffa335ee|Hitem:178781::::::::60:270::57:4:6652:7574:1566:6646:1:28:483:::::|h[儀式指揮者之戒]|h|r",
		}, -- [12]
		nil, -- [13]
		nil, -- [14]
		{
			["ID"] = 178755,
			["Level"] = 252,
			["Link"] = "|cffa335ee|Hitem:178755::::::::60:270::57:3:6652:1566:6646:1:28:483:::::|h[荒疫藩侯披風]|h|r",
		}, -- [15]
		{
			["ID"] = 186406,
			["Level"] = 259,
			["Link"] = "|cffa335ee|Hitem:186406::::::::60:270::57:3:6652:1498:6646:1:28:483:::::|h[詛咒代表作]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "MONK",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
