
PawnOptions = {
	["LastVersion"] = 2.0713,
	["LastPlayerFullName"] = "下雪吧下雪-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 153822,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153822::::::::60:64::86:1:1602::::::|h[高山賢者兜帽]|h|r",
		}, -- [1]
		{
			["ID"] = 153815,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153815::::::::60:64::86:1:1602::::::|h[高山賢者勳章]|h|r",
		}, -- [2]
		{
			["ID"] = 153825,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153825::::::::60:64::86:1:1602::::::|h[高山賢者肩墊]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 153824,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153824::::::::60:64::86:1:1602::::::|h[高山賢者長袍]|h|r",
		}, -- [5]
		{
			["ID"] = 153826,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153826::::::::60:64::86:1:1602::::::|h[高山賢者之索]|h|r",
		}, -- [6]
		{
			["ID"] = 153823,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153823::::::::60:64::86:1:1602::::::|h[高山賢者護腿]|h|r",
		}, -- [7]
		{
			["ID"] = 153820,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153820::::::::60:64::86:1:1602::::::|h[高山賢者便鞋]|h|r",
		}, -- [8]
		{
			["ID"] = 153827,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153827::::::::60:64::86:1:1602::::::|h[高山賢者裹腕]|h|r",
		}, -- [9]
		{
			["ID"] = 153821,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153821::::::::60:64::86:1:1602::::::|h[高山賢者裹手]|h|r",
		}, -- [10]
		{
			["ID"] = 153818,
			["Level"] = 180,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:153818::::::::60:64::86:1:1602::::::|h[高山賢者毀滅之戒]|h|r",
		}, -- [11]
		{
			["ID"] = 153817,
			["Level"] = 180,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:153817::::::::60:64::86:1:1602::::::|h[高山賢者毀滅指環]|h|r",
		}, -- [12]
		{
			["ID"] = 153816,
			["Level"] = 180,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:153816::::::::60:64::86:1:1602::::::|h[高山賢者毀滅塑像]|h|r",
		}, -- [13]
		{
			["ID"] = 153819,
			["Level"] = 180,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:153819::::::::60:64::86:1:1602::::::|h[高山賢者毀滅之石]|h|r",
		}, -- [14]
		{
			["ID"] = 153829,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153829::::::::60:64::86:1:1602::::::|h[高山賢者毀滅披風]|h|r",
		}, -- [15]
		{
			["ID"] = 153830,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:153830::::::::60:64::86:1:1602::::::|h[高山賢者法杖]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "MAGE",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
