
PawnOptions = {
	["LastVersion"] = 2.053,
	["LastPlayerFullName"] = "只用來看裝備-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 153757,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153757::::::::48:102::61:1:1477::::|h[春雨首盔]|h|r",
		}, -- [1]
		{
			["ID"] = 153763,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153763::::::::48:102::61:1:1477::::|h[春雨勳章]|h|r",
		}, -- [2]
		{
			["ID"] = 153759,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153759::::::::48:102::61:1:1477::::|h[春雨肩甲]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 153754,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153754::::::::48:102::61:1:1477::::|h[春雨外套]|h|r",
		}, -- [5]
		{
			["ID"] = 153761,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153761::::::::48:102::61:1:1477::::|h[春雨腰帶]|h|r",
		}, -- [6]
		{
			["ID"] = 153758,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153758::::::::48:102::61:1:1477::::|h[春雨護腿]|h|r",
		}, -- [7]
		{
			["ID"] = 153755,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153755::::::::48:102::61:1:1477::::|h[春雨足靴]|h|r",
		}, -- [8]
		{
			["ID"] = 153762,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153762::::::::48:102::61:1:1477::::|h[春雨護腕]|h|r",
		}, -- [9]
		{
			["ID"] = 153756,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153756::::::::48:102::61:1:1477::::|h[春雨之握]|h|r",
		}, -- [10]
		{
			["ID"] = 153765,
			["Level"] = 55,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:153765::::::::48:102::61:1:1477::::|h[春雨毀滅指環]|h|r",
		}, -- [11]
		{
			["ID"] = 153766,
			["Level"] = 55,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:153766::::::::48:102::61:1:1477::::|h[春雨毀滅之戒]|h|r",
		}, -- [12]
		{
			["ID"] = 153767,
			["Level"] = 55,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:153767::::::::48:102::61:1:1477::::|h[春雨毀滅之石]|h|r",
		}, -- [13]
		{
			["ID"] = 153764,
			["Level"] = 55,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:153764::::::::48:102::61:1:1477::::|h[春雨毀滅塑像]|h|r",
		}, -- [14]
		{
			["ID"] = 153783,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153783::::::::48:102::61:1:1477::::|h[春雨毀滅披風]|h|r",
		}, -- [15]
		{
			["ID"] = 153760,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153760::::::::48:102::61:1:1477::::|h[春雨護杖]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "DRUID",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
