
PawnOptions = {
	["LastVersion"] = 2.0606,
	["LastPlayerFullName"] = "Poppop-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 153808,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153808::::::::50:255::62:1:1490::::::|h[尋蹤者頭盔]|h|r",
		}, -- [1]
		{
			["ID"] = 153800,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153800::::::::50:255::62:1:1490::::::|h[尋蹤者頸飾]|h|r",
		}, -- [2]
		{
			["ID"] = 153810,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153810::::::::50:255::62:1:1490::::::|h[尋蹤者肩甲]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 153805,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153805::::::::50:255::62:1:1490::::::|h[尋蹤者外衣]|h|r",
		}, -- [5]
		{
			["ID"] = 153811,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153811::::::::50:255::62:1:1490::::::|h[尋蹤者腰帶]|h|r",
		}, -- [6]
		{
			["ID"] = 153809,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153809::::::::50:255::62:1:1490::::::|h[尋蹤者腿甲]|h|r",
		}, -- [7]
		{
			["ID"] = 153806,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153806::::::::50:255::62:1:1490::::::|h[尋蹤者護脛]|h|r",
		}, -- [8]
		{
			["ID"] = 153812,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153812::::::::50:255::62:1:1490::::::|h[尋蹤者護腕]|h|r",
		}, -- [9]
		{
			["ID"] = 153807,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153807::::::::50:255::62:1:1490::::::|h[尋蹤者護手]|h|r",
		}, -- [10]
		{
			["ID"] = 153803,
			["Level"] = 68,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:153803::::::::50:255::62:1:1490::::::|h[尋蹤者突襲之戒]|h|r",
		}, -- [11]
		{
			["ID"] = 153802,
			["Level"] = 68,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:153802::::::::50:255::62:1:1490::::::|h[尋蹤者突襲指環]|h|r",
		}, -- [12]
		{
			["ID"] = 153801,
			["Level"] = 68,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:153801::::::::50:255::62:1:1490::::::|h[尋蹤者憤怒塑像]|h|r",
		}, -- [13]
		{
			["ID"] = 153804,
			["Level"] = 68,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:153804::::::::50:255::62:1:1490::::::|h[尋蹤者憤怒之石]|h|r",
		}, -- [14]
		{
			["ID"] = 153799,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153799::::::::50:255::62:1:1490::::::|h[尋蹤者憤怒披風]|h|r",
		}, -- [15]
		{
			["ID"] = 153814,
			["Level"] = 68,
			["Link"] = "|cff1eff00|Hitem:153814::::::::50:255::62:1:1490::::::|h[尋蹤者長矛]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "HUNTER",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
