
PawnOptions = {
	["LastVersion"] = 2.0807,
	["LastPlayerFullName"] = "粉紅塔里克-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 154029,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154029::::::::60:71::86:1:1602::::::|h[誓語頭盔]|h|r",
		}, -- [1]
		{
			["ID"] = 154118,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154118::::::::60:71::86:1:1602::::::|h[誓語墜飾]|h|r",
		}, -- [2]
		{
			["ID"] = 154031,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154031::::::::60:71::86:1:1602::::::|h[誓語肩鎧]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 154026,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154026::::::::60:71::86:1:1602::::::|h[誓語胸甲]|h|r",
		}, -- [5]
		{
			["ID"] = 154032,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154032::::::::60:71::86:1:1602::::::|h[誓語束腰]|h|r",
		}, -- [6]
		{
			["ID"] = 154030,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154030::::::::60:71::86:1:1602::::::|h[誓語腿鎧]|h|r",
		}, -- [7]
		{
			["ID"] = 154027,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154027::::::::60:71::86:1:1602::::::|h[誓語脛甲]|h|r",
		}, -- [8]
		{
			["ID"] = 154033,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154033::::::::60:71::86:1:1602::::::|h[誓語護臂]|h|r",
		}, -- [9]
		{
			["ID"] = 154028,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154028::::::::60:71::86:1:1602::::::|h[誓語護手]|h|r",
		}, -- [10]
		{
			["ID"] = 154115,
			["Level"] = 180,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:154115::::::::60:71::86:1:1602::::::|h[誓語力量指環]|h|r",
		}, -- [11]
		{
			["ID"] = 154114,
			["Level"] = 180,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:154114::::::::60:71::86:1:1602::::::|h[誓語力量戒指]|h|r",
		}, -- [12]
		{
			["ID"] = 154116,
			["Level"] = 180,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:154116::::::::60:71::86:1:1602::::::|h[誓語戰鬥塑像]|h|r",
		}, -- [13]
		{
			["ID"] = 154117,
			["Level"] = 180,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:154117::::::::60:71::86:1:1602::::::|h[誓語戰鬥之石]|h|r",
		}, -- [14]
		{
			["ID"] = 154119,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154119::::::::60:71::86:1:1602::::::|h[誓語戰鬥披風]|h|r",
		}, -- [15]
		{
			["ID"] = 154025,
			["Level"] = 180,
			["Link"] = "|cff1eff00|Hitem:154025::::::::60:71::86:1:1602::::::|h[誓語巨斧]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "WARRIOR",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
