
ElvCharacterDB = {
	["ConvertKeybindings"] = true,
	["ChatEditHistory"] = {
		"恩恩武器不能塑型", -- [1]
		"應該可以拿才對 可以使用弓的話", -- [2]
	},
	["ChatHistoryLog"] = {
		{
			"武器不能塑形啦 我是說可以拿塑形不是戰士本人塑", -- [1]
			"|Kq26|k", -- [2]
			"", -- [3]
			"", -- [4]
			"", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			0, -- [10]
			152, -- [11]
			false, -- [12]
			133, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc59a6c逆星犬|r",
			[51] = 1637647349,
			[50] = "CHAT_MSG_BN_WHISPER",
			[53] = "逆星犬",
		}, -- [1]
		{
			"恩恩武器不能塑型", -- [1]
			"|Kq26|k", -- [2]
			"", -- [3]
			"", -- [4]
			"", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			0, -- [10]
			153, -- [11]
			false, -- [12]
			133, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc59a6c逆星犬|r",
			[51] = 1637647367,
			[50] = "CHAT_MSG_BN_WHISPER_INFORM",
			[53] = "逆星犬",
		}, -- [2]
		{
			"應該可以拿才對 可以使用弓的話", -- [1]
			"|Kq26|k", -- [2]
			"", -- [3]
			"", -- [4]
			"", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			0, -- [10]
			154, -- [11]
			false, -- [12]
			133, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc59a6c逆星犬|r",
			[51] = 1637647378,
			[50] = "CHAT_MSG_BN_WHISPER_INFORM",
			[53] = "逆星犬",
		}, -- [3]
	},
}
