
HandyNotes_DragonflightTreasuresDB = {
	["profileKeys"] = {
		["暮頌 - 屠魔山谷"] = "暮頌 - 屠魔山谷",
		["我會飛那你呢 - 屠魔山谷"] = "我會飛那你呢 - 屠魔山谷",
		["蘭德貝爾德 - 屠魔山谷"] = "蘭德貝爾德 - 屠魔山谷",
		["都是他們的錯 - 屠魔山谷"] = "都是他們的錯 - 屠魔山谷",
		["有失未必有德 - 屠魔山谷"] = "有失未必有德 - 屠魔山谷",
		["想要跟你飛 - 屠魔山谷"] = "想要跟你飛 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 屠魔山谷"] = "一輪輪胖嘟嘟 - 屠魔山谷",
		["夕行 - 屠魔山谷"] = "夕行 - 屠魔山谷",
		["粉紅塔里克 - 屠魔山谷"] = "粉紅塔里克 - 屠魔山谷",
	},
	["profiles"] = {
		["暮頌 - 屠魔山谷"] = {
		},
		["我會飛那你呢 - 屠魔山谷"] = {
		},
		["蘭德貝爾德 - 屠魔山谷"] = {
		},
		["都是他們的錯 - 屠魔山谷"] = {
		},
		["有失未必有德 - 屠魔山谷"] = {
		},
		["想要跟你飛 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 屠魔山谷"] = {
		},
		["夕行 - 屠魔山谷"] = {
		},
		["粉紅塔里克 - 屠魔山谷"] = {
		},
	},
}
