
HandyNotesDB = {
	["profileKeys"] = {
		["蘭德貝爾德 - 屠魔山谷"] = "蘭德貝爾德 - 屠魔山谷",
		["有失未必有德 - 屠魔山谷"] = "有失未必有德 - 屠魔山谷",
		["一輪輪肥嘟嘟 - 尖石"] = "一輪輪肥嘟嘟 - 尖石",
		["一輪輪肥嘟嘟 - 屠魔山谷"] = "一輪輪肥嘟嘟 - 屠魔山谷",
		["下雪吧下雪 - 屠魔山谷"] = "下雪吧下雪 - 屠魔山谷",
		["Poppop - 屠魔山谷"] = "Poppop - 屠魔山谷",
		["鎖甲好難穿搭 - 屠魔山谷"] = "鎖甲好難穿搭 - 屠魔山谷",
		["我會飛那你呢 - 屠魔山谷"] = "我會飛那你呢 - 屠魔山谷",
		["撕開你的一切 - 屠魔山谷"] = "撕開你的一切 - 屠魔山谷",
		["想要跟你飛 - 屠魔山谷"] = "想要跟你飛 - 屠魔山谷",
		["都是他們的錯 - 屠魔山谷"] = "都是他們的錯 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 尖石"] = "一輪輪胖嘟嘟 - 尖石",
		["暮頌 - 屠魔山谷"] = "暮頌 - 屠魔山谷",
		["只用來看裝備 - 屠魔山谷"] = "只用來看裝備 - 屠魔山谷",
		["夕行 - 屠魔山谷"] = "夕行 - 屠魔山谷",
		["稅道夏武 - 尖石"] = "稅道夏武 - 尖石",
		["想要跟你飛 - 尖石"] = "想要跟你飛 - 尖石",
		["馬可西亞斯 - 屠魔山谷"] = "馬可西亞斯 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 屠魔山谷"] = "一輪輪胖嘟嘟 - 屠魔山谷",
		["粉紅塔里克 - 屠魔山谷"] = "粉紅塔里克 - 屠魔山谷",
	},
	["profiles"] = {
		["蘭德貝爾德 - 屠魔山谷"] = {
		},
		["有失未必有德 - 屠魔山谷"] = {
		},
		["一輪輪肥嘟嘟 - 尖石"] = {
		},
		["一輪輪肥嘟嘟 - 屠魔山谷"] = {
		},
		["下雪吧下雪 - 屠魔山谷"] = {
		},
		["Poppop - 屠魔山谷"] = {
		},
		["鎖甲好難穿搭 - 屠魔山谷"] = {
		},
		["我會飛那你呢 - 屠魔山谷"] = {
		},
		["撕開你的一切 - 屠魔山谷"] = {
		},
		["想要跟你飛 - 屠魔山谷"] = {
		},
		["都是他們的錯 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 尖石"] = {
		},
		["暮頌 - 屠魔山谷"] = {
		},
		["只用來看裝備 - 屠魔山谷"] = {
		},
		["夕行 - 屠魔山谷"] = {
		},
		["稅道夏武 - 尖石"] = {
		},
		["想要跟你飛 - 尖石"] = {
		},
		["馬可西亞斯 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 屠魔山谷"] = {
		},
		["粉紅塔里克 - 屠魔山谷"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["蘭德貝爾德 - 屠魔山谷"] = "蘭德貝爾德 - 屠魔山谷",
		["有失未必有德 - 屠魔山谷"] = "有失未必有德 - 屠魔山谷",
		["一輪輪肥嘟嘟 - 尖石"] = "一輪輪肥嘟嘟 - 尖石",
		["一輪輪肥嘟嘟 - 屠魔山谷"] = "一輪輪肥嘟嘟 - 屠魔山谷",
		["下雪吧下雪 - 屠魔山谷"] = "下雪吧下雪 - 屠魔山谷",
		["Poppop - 屠魔山谷"] = "Poppop - 屠魔山谷",
		["鎖甲好難穿搭 - 屠魔山谷"] = "鎖甲好難穿搭 - 屠魔山谷",
		["我會飛那你呢 - 屠魔山谷"] = "我會飛那你呢 - 屠魔山谷",
		["撕開你的一切 - 屠魔山谷"] = "撕開你的一切 - 屠魔山谷",
		["想要跟你飛 - 屠魔山谷"] = "想要跟你飛 - 屠魔山谷",
		["都是他們的錯 - 屠魔山谷"] = "都是他們的錯 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 尖石"] = "一輪輪胖嘟嘟 - 尖石",
		["暮頌 - 屠魔山谷"] = "暮頌 - 屠魔山谷",
		["只用來看裝備 - 屠魔山谷"] = "只用來看裝備 - 屠魔山谷",
		["夕行 - 屠魔山谷"] = "夕行 - 屠魔山谷",
		["稅道夏武 - 尖石"] = "稅道夏武 - 尖石",
		["想要跟你飛 - 尖石"] = "想要跟你飛 - 尖石",
		["馬可西亞斯 - 屠魔山谷"] = "馬可西亞斯 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 屠魔山谷"] = "一輪輪胖嘟嘟 - 屠魔山谷",
		["粉紅塔里克 - 屠魔山谷"] = "粉紅塔里克 - 屠魔山谷",
	},
	["profiles"] = {
		["蘭德貝爾德 - 屠魔山谷"] = {
		},
		["有失未必有德 - 屠魔山谷"] = {
		},
		["一輪輪肥嘟嘟 - 尖石"] = {
		},
		["一輪輪肥嘟嘟 - 屠魔山谷"] = {
		},
		["下雪吧下雪 - 屠魔山谷"] = {
		},
		["Poppop - 屠魔山谷"] = {
		},
		["鎖甲好難穿搭 - 屠魔山谷"] = {
		},
		["我會飛那你呢 - 屠魔山谷"] = {
		},
		["撕開你的一切 - 屠魔山谷"] = {
		},
		["想要跟你飛 - 屠魔山谷"] = {
		},
		["都是他們的錯 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 尖石"] = {
		},
		["暮頌 - 屠魔山谷"] = {
		},
		["只用來看裝備 - 屠魔山谷"] = {
		},
		["夕行 - 屠魔山谷"] = {
		},
		["稅道夏武 - 尖石"] = {
		},
		["想要跟你飛 - 尖石"] = {
		},
		["馬可西亞斯 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 屠魔山谷"] = {
		},
		["粉紅塔里克 - 屠魔山谷"] = {
		},
	},
}
