
MogItDB = {
	["profileKeys"] = {
		["鎖甲好難穿搭 - 屠魔山谷"] = "Default",
		["撕開你的一切 - 屠魔山谷"] = "Default",
		["蘭德貝爾德 - 屠魔山谷"] = "Default",
		["都是他們的錯 - 屠魔山谷"] = "Default",
		["有失未必有德 - 屠魔山谷"] = "Default",
		["只用來看裝備 - 屠魔山谷"] = "Default",
		["一輪輪肥嘟嘟 - 屠魔山谷"] = "Default",
		["一輪輪胖嘟嘟 - 尖石"] = "Default",
		["一輪輪胖嘟嘟 - 屠魔山谷"] = "Default",
		["夕行 - 屠魔山谷"] = "Default",
		["暮頌 - 屠魔山谷"] = "Default",
	},
	["global"] = {
		["version"] = "3.9.6",
	},
	["profiles"] = {
		["Default"] = {
			["previewProps"] = {
				{
					["y"] = 36.5713996887207,
					["w"] = 334.9999694824219,
					["x"] = -248.8888092041016,
				}, -- [1]
			},
			["x"] = 0,
			["slotLabels"] = {
				["Waist"] = "腰部",
				["Fist"] = "拳套",
				["Tabard"] = "外袍",
				["Shield"] = "盾牌",
				["Back"] = "背部",
				["Crossbow"] = "弩",
				["2H-axe"] = "雙手斧",
				["Shirt"] = "襯衣",
				["Dagger"] = "匕首",
				["Hands"] = "手",
				["Wrist"] = "手腕",
				["Polearm"] = "長柄武器",
				["2H-sword"] = "雙手劍",
				["Warglaives"] = "戰刃",
				["2H-mace"] = "雙手錘",
				["1H-mace"] = "單手錘",
				["1H-axe"] = "單手斧",
				["Holdable"] = "副手物品",
				["Bow"] = "弓",
				["1H-sword"] = "單手劍",
				["Staff"] = "法杖",
				["Chest"] = "胸部",
				["Head"] = "頭部",
				["Legs"] = "腿部",
				["Feet"] = "腳",
				["ArtifactLegion"] = "《軍臨天下》神兵武器",
				["Gun"] = "槍械",
				["Shoulder"] = "肩部",
				["Wand"] = "魔杖",
			},
			["minimap"] = {
				["minimapPos"] = 324.4129894356756,
			},
			["gridWidth"] = 599.9998779296875,
			["y"] = 0,
		},
	},
}
MogItWishlist = {
	["global"] = {
		["version"] = 90200,
	},
	["profileKeys"] = {
		["鎖甲好難穿搭 - 屠魔山谷"] = "鎖甲好難穿搭 - 屠魔山谷",
		["撕開你的一切 - 屠魔山谷"] = "撕開你的一切 - 屠魔山谷",
		["蘭德貝爾德 - 屠魔山谷"] = "蘭德貝爾德 - 屠魔山谷",
		["都是他們的錯 - 屠魔山谷"] = "都是他們的錯 - 屠魔山谷",
		["有失未必有德 - 屠魔山谷"] = "有失未必有德 - 屠魔山谷",
		["只用來看裝備 - 屠魔山谷"] = "只用來看裝備 - 屠魔山谷",
		["一輪輪肥嘟嘟 - 屠魔山谷"] = "一輪輪肥嘟嘟 - 屠魔山谷",
		["一輪輪胖嘟嘟 - 尖石"] = "一輪輪胖嘟嘟 - 尖石",
		["一輪輪胖嘟嘟 - 屠魔山谷"] = "一輪輪胖嘟嘟 - 屠魔山谷",
		["夕行 - 屠魔山谷"] = "夕行 - 屠魔山谷",
		["暮頌 - 屠魔山谷"] = "暮頌 - 屠魔山谷",
	},
	["profiles"] = {
		["鎖甲好難穿搭 - 屠魔山谷"] = {
		},
		["撕開你的一切 - 屠魔山谷"] = {
		},
		["蘭德貝爾德 - 屠魔山谷"] = {
		},
		["都是他們的錯 - 屠魔山谷"] = {
		},
		["有失未必有德 - 屠魔山谷"] = {
		},
		["只用來看裝備 - 屠魔山谷"] = {
		},
		["一輪輪肥嘟嘟 - 屠魔山谷"] = {
		},
		["一輪輪胖嘟嘟 - 尖石"] = {
		},
		["一輪輪胖嘟嘟 - 屠魔山谷"] = {
		},
		["夕行 - 屠魔山谷"] = {
		},
		["暮頌 - 屠魔山谷"] = {
		},
	},
}
