
PawnOptions = {
	["LastVersion"] = 2.053,
	["LastPlayerFullName"] = "鎖甲好難穿搭-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 153808,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153808::::::::48:253::61:1:1477::::|h[尋蹤者頭盔]|h|r",
		}, -- [1]
		{
			["ID"] = 153800,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153800::::::::48:253::61:1:1477::::|h[尋蹤者頸飾]|h|r",
		}, -- [2]
		{
			["ID"] = 153810,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153810::::::::48:253::61:1:1477::::|h[尋蹤者肩甲]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 153805,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153805::::::::48:253::61:1:1477::::|h[尋蹤者外衣]|h|r",
		}, -- [5]
		{
			["ID"] = 153811,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153811::::::::48:253::61:1:1477::::|h[尋蹤者腰帶]|h|r",
		}, -- [6]
		{
			["ID"] = 153809,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153809::::::::48:253::61:1:1477::::|h[尋蹤者腿甲]|h|r",
		}, -- [7]
		{
			["ID"] = 153806,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153806::::::::48:253::61:1:1477::::|h[尋蹤者護脛]|h|r",
		}, -- [8]
		{
			["ID"] = 153812,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153812::::::::48:253::61:1:1477::::|h[尋蹤者護腕]|h|r",
		}, -- [9]
		{
			["ID"] = 153807,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153807::::::::48:253::61:1:1477::::|h[尋蹤者護手]|h|r",
		}, -- [10]
		{
			["ID"] = 153803,
			["Level"] = 55,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:153803::::::::48:253::61:1:1477::::|h[尋蹤者突襲之戒]|h|r",
		}, -- [11]
		{
			["ID"] = 153802,
			["Level"] = 55,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:153802::::::::48:253::61:1:1477::::|h[尋蹤者突襲指環]|h|r",
		}, -- [12]
		{
			["ID"] = 153804,
			["Level"] = 55,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:153804::::::::48:253::61:1:1477::::|h[尋蹤者憤怒之石]|h|r",
		}, -- [13]
		{
			["ID"] = 153801,
			["Level"] = 55,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:153801::::::::48:253::61:1:1477::::|h[尋蹤者憤怒塑像]|h|r",
		}, -- [14]
		{
			["ID"] = 153799,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153799::::::::48:253::61:1:1477::::|h[尋蹤者憤怒披風]|h|r",
		}, -- [15]
		{
			["ID"] = 153813,
			["Level"] = 55,
			["Link"] = "|cff1eff00|Hitem:153813::::::::48:253::61:1:1477::::|h[尋蹤者獵槍]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "HUNTER",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
