
PawnOptions = {
	["LastVersion"] = 2.0805,
	["LastPlayerFullName"] = "馬可西亞斯-屠魔山谷",
	["AutoSelectScales"] = true,
	["ItemLevels"] = {
		{
			["ID"] = 154016,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154016::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂風帽]|h|r",
		}, -- [1]
		{
			["ID"] = 154009,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154009::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂勳章]|h|r",
		}, -- [2]
		{
			["ID"] = 154019,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154019::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂肩墊]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 154018,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154018::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂長袍]|h|r",
		}, -- [5]
		{
			["ID"] = 154020,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154020::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂之索]|h|r",
		}, -- [6]
		{
			["ID"] = 154017,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154017::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂護腿]|h|r",
		}, -- [7]
		{
			["ID"] = 154014,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154014::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂便鞋]|h|r",
		}, -- [8]
		{
			["ID"] = 154021,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154021::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂裹腕]|h|r",
		}, -- [9]
		{
			["ID"] = 154015,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154015::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂裹手]|h|r",
		}, -- [10]
		{
			["ID"] = 154011,
			["Level"] = 26,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:154011::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂毀滅指環]|h|r",
		}, -- [11]
		{
			["ID"] = 154012,
			["Level"] = 26,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff1eff00|Hitem:154012::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂毀滅之戒]|h|r",
		}, -- [12]
		{
			["ID"] = 154010,
			["Level"] = 26,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff1eff00|Hitem:154010::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂毀滅塑像]|h|r",
		}, -- [13]
		{
			["ID"] = 154013,
			["Level"] = 26,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff1eff00|Hitem:154013::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂毀滅之石]|h|r",
		}, -- [14]
		{
			["ID"] = 154023,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154023::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂毀滅披風]|h|r",
		}, -- [15]
		{
			["ID"] = 154024,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:154024::::::::10:266::17:1:9370:1:9:10:::::|h[惡魔靈魂法杖]|h|r",
		}, -- [16]
	},
	["LastKeybindingsSet"] = 1,
}
PawnMrRobotScaleProviderOptions = {
	["LastClass"] = "WARLOCK",
	["LastAdded"] = 1,
}
PawnClassicScaleProviderOptions = nil
